{"text": "Good and clean hospital. There is great team of doctors and good OT facility. The medical facilities are all great with good in-patient post operative care by doctors, nurses. The housekeeping staff is also good but they can respond to calls from the room a little faster.", "label": "positive"}
{"text": "Had a really bad experience during discharge. They need to be sensitive and more transparent towards the patient and his/her family.", "label": "positive"}
{"text": "I have visited to take my second dose and Process was really smooth. Hospitality from all staffs are really appreciable. Shanti tooks good care and provide all details before vaccination. Thank you.", "label": "positive"}
{"text": "That person was slightly clueless and offered only one package. But once i got to the hospital, I found a better and more economical one and decided to go ahead", "label": "neutral"}
{"text": "There is great team of doctors and good OT facility.", "label": "negative"}
{"text": "My primary concern arose from the insistence on conducting multiple tests, which appeared unrelated to my condition, before initiating any treatment.", "label": "negative"}
{"text": "Good and clean hospital. The medical facilities are all great with good in-patient post operative care by doctors, nurses. The housekeeping staff is also good but they can respond to calls from the room a little faster.", "label": "positive"}
{"text": "Recently underwent a surgery for my left shoulder, the doctors are extremely good, but the management needs to be more patient oriented than money minded.", "label": "neutral"}
{"text": "Over all experience was good, starting from reception,lab services and doctors interaction.Doctor with whom I have had consultation was so nice.He heard me with patience and clarified all my health condition.", "label": "positive"}
{"text": "However,the services of front office (where we report first) need to be improved( services should be fast).", "label": "positive"}
{"text": "Other wise no complaints, fully satisfied.", "label": "positive"}
{"text": "Thanks to the Emergency doctor abhishek and Thanks to the security guard there", "label": "positive"}
{"text": "They have expert doctors who gives the right medicines and helps the patients recover fast.", "label": "positive"}
{"text": "I really liked the service there!", "label": "positive"}
{"text": "Hopeless hospital. I don't know how they have got JCI and NABH. They have no value for patients or their attendants time.", "label": "negative"}
{"text": "Receptionists only want money. They don't care if the doctor is 2 hrs late but give them money.", "label": "negative"}
{"text": "I went for my father. He has tracheostomy n all issues. They made him wait for 1 hour n said wait if you want to or go.", "label": "negative"}
{"text": "I called them to book an appointment, i requested for a senior doctor and seeked their years of experience, they don't want to share it, transparency is not there. when i called Appolo they give all the detail's,experience and i feel comfortable while choosing Doctor. Fortis,pls have transperency and it is right of a patient.", "label": "negative"}
{"text": "I was having menopause related issues and went to see a gynecologist.", "label": "positive"}
{"text": "Say hello with folded hands.and Take the patient sitting in the wheel chair ...", "label": "positive"}
{"text": "I noticed the price there is a bit high. But the treatment is very good and the behavior of the doctor is also very good.so I don't think such a hospital is anywhere near HRS Layout.", "label": "positive"}
{"text": "Good experience, polite staff and timely service, well organized and hygienic", "label": "positive"}
{"text": "a very nice experience during our stay and Treatment in the Fortis Hospital from 27-7-2023 to 3-8-2023. We felt like staying in our own home. Dr.Rajkumar Deshpande and his team Done the C1& C2 Surgical Spine Replacement under O arm Machine successfully .Doctors and other supporting staff for their wonderful services.", "label": "positive"}
{"text": "Highly experienced doctors. Their analysis, interactions and treatment are excellent.", "label": "positive"}
{"text": "The rooms are very neat and clean. Very good house keeping.", "label": "positive"}
{"text": "The staff nurses are down to earth. Their caring and hospitality is highly appreciable.", "label": "positive"}
{"text": "Overall, the services from admission till discharge is excellent.", "label": "positive"}
{"text": "We loved the hospitality of the staff members and doctors. They are so hardworking and put efforts to ensure good health and safety of the patients. Dr. Gayathri is an excellent doctor who also provides you guidance and emotional support", "label": "positive"}
{"text": "The hospital service has been really good. The patient has been taken good care overall right from the consultation until the discharge, everything is seamless and hassle free. We went with the insurance and the processing time was quick.", "label": "positive"}
{"text": "Dr. Sashidhara, cardiologist took every effort to diagnose the problem and suggested for the bypass and later the Surgeon", "label": "positive"}
{"text": "Dr. Murali Manohar took care of the operation with great confidence. Overall, it was a good experience throughout.", "label": "positive"}
{"text": "Everything is well organised with the various rooms (for photo, blood test, xray, main doctor's consultation etc) all situated around the huge waiting room with the sequence you have to follow communicated to you at the billing counter.", "label": "positive"}
{"text": "Card payment is accepted.", "label": "positive"}
{"text": "While the cost of the tests is perhaps just a tad bit more than the other option (Elbit diagnostics), the convenience and service more than make up for it.", "label": "neutral"}
{"text": "While prior appointment booking is not required, you are advised to call before coming because the forms for some countries have to be printed and brought along with you (while others are available there).", "label": "neutral"}
{"text": "The place can get quite crowded so if you wish to get done with all formalities within 1.5-2 hours, it is better to reach there before 830am when the billing counter opens. Don't forget to pick out a token from the machine near the counter.", "label": "neutral"}
{"text": "We are really satisfied with the service from Fortis. There is no negative point about this hospital. Well maintained and very systematic. The best part is your time will not be wasted even for 1 min. Thanks for the doctors and all other workers.", "label": "positive"}
{"text": "Had an emergency visit to the hospital with my father who was hospitalised for a couple of days due to a surgery. The doctors and staff of the hospital took utmost care. The best part of the hospital is that the team follows its processes and protocols so well.", "label": "positive"}
{"text": "We had a great experience with the hospital.", "label": "positive"}
{"text": "Dr.Jawali and his team were very impressive not only for the surgery and procedure but also post operative following up with the patient and ensuring he was feeling absolutely.", "label": "positive"}
{"text": "I would also thank the ICU nurses and the ward Nurses and all the different Dr.’s who were involved in ensuring my father recovered. Thank you So much !!!", "label": "positive"}
{"text": "Great care taken by the staff and hospital !! Special mention of Dr Vivek Padegal and Dr Ashish Parekh. Thanks to energetic and charming Nurse Ms Jacqueline for special care taken while treatment !!", "label": "positive"}
{"text": "Dr Ravindra and team was excellent.", "label": "positive"}
{"text": "Treatment given to the partient was impeccable! All the staff are much recognized for their dedication and kindness given to the patient throughout.", "label": "positive"}
{"text": "Immense gratitude to all the Fortis team for ensuring my well-being, ensuring comfort and fast recovery.", "label": "positive"}
{"text": "Thank you once again for your outstanding service and commitment towards excellence. Each one's role and efforts are much appreciated..", "label": "positive"}
{"text": "Dr. Narayan Hulse is an amazing doctor. Nurses are also very humble and caring.", "label": "positive"}
{"text": "Midnight also they are very quick and active. They are present near the patient whenever needed.", "label": "positive"}
{"text": "Food service is also very good. Housekeepers are doing their job efficiently. The hospital is very clean.", "label": "positive"}
{"text": "My co-sister, 81 had a knee replacement during covid. Post surgery had complications pain did not subside. She became totally bedridden.", "label": "positive"}
{"text": "We met Dr. Narayan Hulse at Fortis for his opinion. He gave us 100% assurance and operated her.", "label": "positive"}
{"text": "She walks now independently of course with Walker. She is ever grateful to him. Thanks a ton Doctor for giving her another life.", "label": "positive"}
{"text": "They book more appointments than capacity. My wife went for checkup in Fortis and my friend went to Hiranandani in Mumbai. Started same time at 8 am today. Friend finished the process by 11:30. Wife finished at 4 pm. Avoid for master health checkup.", "label": "neutral"}
{"text": "Don't go buy name of the hospital.", "label": "negative"}
{"text": "Worst experience when we went for the full body health checkup..", "label": "negative"}
{"text": "They do not care.. only thing they care is money. Once money is in their bank account you are on your own.", "label": "negative"}
{"text": "The staff for health checkup is worst and doesn't know how to manage people and give proper guidance.", "label": "negative"}
{"text": "If you say you do not have any visible issue they will finish the examination in less than a minute and send you out to serve next customer.", "label": "negative"}
{"text": "Poor service, disorganized, no value for people's time and over-priced.", "label": "negative"}
{"text": "After charging a bomb to the patients they have no system in place.", "label": "negative"}
{"text": "Booking an appointment is a joke as you can never get things done as per the appointment time.", "label": "negative"}
{"text": "They expect people to be unemployed or on indefinite leave while visiting their hospital for treatment.", "label": "negative"}
{"text": "The road outside the hospital is full of garbage and dirty potholes, the hospital administration should take some responsibility to make it walk-able for patients and their families.", "label": "negative"}
{"text": "I took a comprehensive health check up package here with an appointment date and time. The total duration we were supposed to wait was around 5-6 hours.", "label": "negative"}
{"text": "I'd suggest just don't go by name. There are lot of local labs who provide much better services in less fees. Truly horrible and unexpected experience at Fortis.", "label": "neutral"}
{"text": "My Heartfelt Plea for Better Patient Care: A Harrowing Experience at Fortis Hospital", "label": "negative"}
{"text": "Please display few boards in the entrance of the hospital and also in the emergency department", "label": "neutral"}
{"text": "Stating THIS HOSPITAL IS NOT FOR MIDDLE CLASS PEOPLE", "label": "neutral"}
{"text": "Nice hospital and doctors also good and they take care patience super.eventhing is super in the hospital 🎉 …", "label": "positive"}
{"text": "Very good hospital and care.Excellent services. Happy with Fortis", "label": "positive"}
{"text": "Dr. Harsha has provided amazing treatment. The night shift nurses are helpful. Overall management was very good.", "label": "positive"}
{"text": "Must visit for Dr Suresh Babu for chemotherapy", "label": "neutral"}
{"text": "Dr Gayathri Kamath is a very good doctor.Very reliable who you can believe in .Very good services at Fortis.She made all my pregnancy complications nothing making it smooth and helped me getting recovered much faster.", "label": "positive"}
{"text": "Dr.Vivek belatur treatment is super . Chemotherapy treatment went well and smooth . Happy with Fortis and it's services.", "label": "positive"}
{"text": "My father has been treated under supervision of Dr Adil Hasaan and Dr Suresh Babu sir.", "label": "positive"}
{"text": "The service provided here is good with very professional and friendly staff. Doctors were very professional, experienced and responsible.", "label": "positive"}
{"text": "Special thanks to Kavita for all the guidance and support she had provided us so far.", "label": "positive"}
{"text": "Very crowdy and excessive long queues. Try to avoid and be happy😊😊 …", "label": "positive"}
{"text": "Such a worst staff in this hospital.", "label": "negative"}
{"text": "they are charging too much for small thing n most important thing is unka security staff Jo apko hospital staff se jyada enquiry karte hai n too much rude behaviour like a roadside loafer", "label": "negative"}
{"text": "The overall dignosis, treantment plan and post opp recevery management was super excellent and have a complete recovery without any post opp complications despite having complex health condition prior to the surgery.", "label": "positive"}
{"text": "The entire doctors team, Dr Gayathri from gynaecology, Dr sharath chandra from surgery and Dr sudha from internal medicine, Dr Shwetha from gynaecology and the nursing staff, have given the best treatment and excellent psychological support to us.", "label": "positive"}
{"text": "They were with us each and every stage planning the best treatment for me and also giving confidence and mental support, that we felt homely.", "label": "positive"}
{"text": "This team of doctors was very friendly, approachable, service oriented and selfless service and extremely professional. Once again a big thank you from the bottom of our heart", "label": "positive"}
{"text": "Dr Mohan Keshavamurthy and team All doctors, All nursing staff, especially 6th floor staff, Jeena Davis nursing supervisor... We thank each and every one for your support.....", "label": "positive"}
{"text": "Always good", "label": "positive"}
{"text": "Dr Manisha Rajpal Singh treated for Laparoscopy, Hysteroscopy, Dilatation & curettage, cervical cauterization, Bilateral Ovarian endometrosis excision. We came from Bangladesh specifically to consult the doctor.", "label": "positive"}
{"text": "Doctor is very professional, caring. Dr Roopa from the team too. Nursing care are superb. Hygiene by support teams", "label": "positive"}
{"text": "I done immigration health check up here in fortis hospital bannargetta..", "label": "positive"}
{"text": "it was amazing experience and helpful staffs especially Ms poornima , Ms manjula ans Santhosh", "label": "positive"}
{"text": "We have visited the hospital for knee replacement for my mother and Dr. Narayan Hulse has treated her very well and explained the minute details as well.", "label": "positive"}
{"text": "Once the surgery is completed my mother has recovered well and thanks to Narayan Hulse and team who treated well and along with physiotherapy, nursing and House keeping department.", "label": "positive"}
{"text": "Excellent treatment in Fortis bannergatta. Dr Anil Kumar Kustagi treatment made my son up and above. Nursing staffs are excellent.", "label": "positive"}
{"text": "Dr Mohan Keshavamurthy operated for kidney stone with laser treatment. Overall treatment services are good. Nursing night staff was very caring.", "label": "positive"}
{"text": "Had a better experience in the treatment of my mother at fortis hospital by Dr. Shashidhara", "label": "positive"}
{"text": "Feel to bow to Dr Narayan Hulse. He is such a great doctor. I am relaxed once I heard from him about the surgery.", "label": "positive"}
{"text": "Big thanks to Dr Narayan Hulse. Nursing Mahalakshmi, Shalini, Nivetha many more attended on me. Very caring. Physio team are excellent in their work.", "label": "positive"}
{"text": "Dr. Mohan Keshavamurthy has done my surgery. Nurses including Josena, Parimala they are very caring.", "label": "positive"}
{"text": "The care and hospitality offered by the staff (from all the departments) and Fortis as a whole is excellent.", "label": "positive"}
{"text": "Most importantly, the treating doctor Mr. Ravindra BS and the whole Gastroenterology department had been effective in diagnosing the health issue appropriately.", "label": "positive"}
{"text": "The treatment given by Dr.Ravindra and Team has brought a lot of improvements in my health and able to cope with my life as a very healthy and confident person. Thanks again for everything. Please keep up the good work!!", "label": "positive"}
{"text": "Dr. Shabeer Ahmed is a very good doctor. He explained everything to us clearly and amazing treatment has been provided", "label": "positive"}
{"text": "My husband is doing well. CABG is done by Dr Vivek Jawali & team Dr Murali Manohar, Dr Sudarshan, Dr Nikhil.", "label": "positive"}
{"text": "Happy with very good service by doctors and staffs ICU staffs are excellent. Polina, Prafulla, Priya toi are excellent. Big thanks to support staffs as well.", "label": "positive"}
{"text": "Dr. Ravindra is undoubtedly an amazing doctor. The efficiency of treatment has helped to cure my health issues. Nurses are also providing good service.", "label": "positive"}
{"text": "Review is for master health checkup.", "label": "negative"}
{"text": "Poorly managed patient flow.", "label": "negative"}
{"text": "They book more appointments than capacity.", "label": "negative"}
{"text": "My wife went for checkup in Fortis and my friend went to Hiranandani in Mumbai. Started same time at 8 am today. Friend finished the process by 11:30. Wife finished at 4 pm. Avoid for master health checkup.", "label": "negative"}
{"text": "Excellent medical facilities and services.", "label": "positive"}
{"text": "We consulted Dr.Sudarshan G T, they treated us very well. We are happy with the hospital service.", "label": "positive"}
{"text": "Dr Vivek Belathur is a very good oncologist. happy with his treatment. Kavitha madam is very helpful and kind.", "label": "positive"}
{"text": "Happy to get treated by Dr Vivek Belathur ,the best oncologist in Bangalore. His care to his patient is wonderful.", "label": "positive"}
{"text": "All the staffs afe caring and responsible.Ms Kavitha is an amazing pesrson who is very helpful in every step of the treatment.Thanks to Fortis.", "label": "positive"}
{"text": "I have been visiting for Cancer treatment. Dr. Suresh Babu is coordinating for the treatment and experience with the doctor and hospital has been good.", "label": "positive"}
{"text": "Nice response from doctor and staff Tq", "label": "positive"}
{"text": "Diagnosis, treatment and care are good", "label": "positive"}
{"text": "hey kept me waiting until 4pm and then after several requests they let me see her. It was unfortunate for me to have gone for a check up and with this rather rude and very arrogant gynecologist.", "label": "negative"}
{"text": "Didn't give anesthesia and directly stabbed (this is the right word) my vagina. It happened 8years back.", "label": "negative"}
{"text": "After that incident I lost sensibility in that part. I could have left the hospital without seeing her if the hospital had not collected the fee in advance.", "label": "negative"}
{"text": "It's a bad practice for the hospital to collect the fee in advance. So patients be alert while selecting your doctor.", "label": "negative"}
{"text": "Not every body is like that. I have been busy all these years and now got free time and thought of sharing my experience", "label": "neutral"}
{"text": "Some of the doctors are very good...", "label": "positive"}
{"text": "but some of them are are really terrible especially the ones who are in emergency.", "label": "neutral"}
{"text": "I had a very good repo for Fortis hospitals but no more ... they are good for themselves good for making money for them by employing such doctors ...", "label": "negative"}
{"text": "And walking from the car parking to the hospital feels like a dungeon, under rattling pipes next to pump rooms and what not. Truly scary.", "label": "negative"}
{"text": "Also, minimum car parking charge of ₹60 was pure loot. I'd barely left the car for 5 mins there, and still had to pay 60.", "label": "neutral"}
{"text": "Administrative service is so irresponsible for orthopaedic department, inspite of collecting token they have not billed me for hrs.", "label": "negative"}
{"text": "I took an appointment for 11 am and its now 12:30 pm but still didn't got to see doctor, the ladies in reception are so rude that they do not care if the patient is suffering due to their delay in billing. They work so slow that patient has to wait for so long.", "label": "negative"}
{"text": "Dr. Rajpal in cardiologist department, this whole Fortis hospital and the App myFortis is a total scam. They took the appointment fees, even when the appointment was cancelled they haven't refunded the amount back. From 12th July to this November i have not got the refund.", "label": "negative"}
{"text": "I mean if you are so backdated and illiterate that you don't even know that account statement pdf and physical passbook would show same records then why even are you trying tO get an app for your hospital.", "label": "negative"}
{"text": "Worst hospital. Simply looting people with too high charges. In emergency there was only 1 nurse who was not able to handle all. In billing there is only one person sitting causing inconvenience to huge queue. Only go there if you have too much money.", "label": "negative"}
{"text": "Highly Disappointed for Security Service very arrogant speaks for all securities and admission counter Are very waste for Customer support Not given Solutions for ward Booking Billing Manager Ram is very careless speaks for customers not given proper solutions..", "label": "negative"}
{"text": "I paid Almost 20 lacks for last one year But Last week I am very Disappointed for Admission counter And Billing Manager And Securities....", "label": "negative"}
{"text": "One of the worst hospital in entire india. Doctors visit for In-patient only once a day with utter non sense knowledge. Unprofessional nurse and administration who treats patients like materials. Expenses is pathetic who takes 50K for just investigation of the patient.", "label": "negative"}
{"text": "Last but not least, Dr. Balaji and Dr. Ravindra were excellent and they deserve to work in a better hospital who values patients better.", "label": "positive"}
{"text": "One of the worst hospitals with one or the worst services.", "label": "negative"}
{"text": "They don’t care about patients, all they care about is money. I wanted to get a few blood tests done, I tried contacting their health check up department but nobody answered. When we call the customer service they say call the health check up department. I had made atleast 15 calls and went off without an answer.", "label": "negative"}
{"text": "Since it was important that the test be done in this particular hospital only, I went there which is around 8 KMs from my house to take an appointment but there also I was given a contact number. Again which no one picked up.", "label": "negative"}
{"text": "One of the worst hospital my mother was admitted she was having ejection fraction of the heart of 35℅ but they gave false information saying 15℅ in the report and the cardiologist doctor venkatesh called us in enquired about our financial information ..", "label": "negative"}
{"text": "Doctors appear to care more about following administrative procedures rather than healing. Pharmacy is not efficient, and does not sell medicine according to dosage. They only care about maximizing profit by selling medicine in full strip instead of how much patients need!", "label": "negative"}
{"text": "Very poor services. I got my blood culture done on 9th June 2023. Till now no reports. I got admitted also, I must say, it is one of the most pathetic hospital. The doctors don’t come. The nurses have to be reminded to give medicine. The food is pathetic, it stinks. Think twice.", "label": "negative"}
{"text": "Went for a equipment service in the hospital, the securitys in back gate are very unprofessional.", "label": "negative"}
{"text": "Met dr Niti Raizada for treatment of micosis fungoids. The team attended us very well. My husband had secondary infection and it was taken care well. Nursing services and hospitality was very good.", "label": "positive"}
{"text": "All services are good. Doctors and nurses are very good. Dr. Mohan Keshavamurthy is an amazing doctorNurse Joseena has helped us whenever we needed. Hospital is clean and well maintained.", "label": "positive"}
{"text": "Dr Rajpal Singh & Dr Jyothi are the best doctors. They brought faith in us. Their approach towards us is humane and are regularly available showing us utmost care. Over all had a very pleasant experience. Everything is maintained well. Grateful to all the nurses who have helped me recover.", "label": "positive"}
{"text": "Dr. Prasanth kesari treats the patient well and operated my daughters finger injury very well and we are satisfied with it Nurse Anju, Sneha, Anshu, Dhaya were very kind and caring.", "label": "positive"}
{"text": "Dr Ajay Rao is an excellent oncologist.We are amazed with his treatment and care given to my mother.Nursing services is wonderful by Ms Ankamma and Ms Sai Rahithya .All the staffs here are very supportive mentally especially Ms Kavitha (SLM).She helped us in every step of the treatment.Special thanks to her .", "label": "positive"}
{"text": "Dr Shivananda Patil is extraordinary....3rd floor ICU Bro Manikandan D, Sis Soumya are superb. Nurses, cleaning staffs in ICU and 6th floor are doing good job. Thank you for your wonderful service. Thank you Dr Shivanand Patil sir.", "label": "positive"}
{"text": "Dr Sheela Chakravarthy is like mu family doctor. We always consult her regarding any issues of my family. Very gentle and kind. Nursing staffs are extremely helpful and on time. Everything went well. Thanks to doctor and her team.", "label": "positive"}
{"text": "Dr Naveen D is really experienced doctor . My mother's knee replacement done by him. He as done a good job. we are very satisfied with his team . thank you sir for your and team's outstanding care and support", "label": "positive"}
{"text": "Treatment by Dr Suresh Babu is very good. We have come for chemotherapy day care treatment. The services are excellent and we are very happy . Staffs are very cooperative and kind. Happy with Fortis.", "label": "positive"}
{"text": "Dr. Manish Joshi and Dr. Shashikiran has treated my husband. The treated provided to him is very helpful for him to recover. Nursing staff are also very caring.", "label": "positive"}
{"text": "My father had colorectal and gallbladder surgery performed by Dr. Shabbir Ahmad, and we were all impressed with his patience and attentive nature.", "label": "positive"}
{"text": "Dr. Anil Kumar Anand Kustagi has provided amazing treatment that helped to recover soon. Nurses, particularly Teena had taken care of us very carefully.", "label": "positive"}
{"text": "Savios music changed the mood and made the stress less. Thank you for the music. Thanks for Dr Nagabhusan sir And Dr Divya madam to supporting us.", "label": "positive"}
{"text": "I am very impressed with Dr Narayan Hulse . Very caring, intelligent , compassionate towards his work. He had given me confidence to undergo bilateral knee replacement so I did and I am very happy with my decision. Great personality.", "label": "positive"}
{"text": "Dr Raju G H counselled treated for gallbladder stone. He is an excellent doctor with humanity. Nursing staffs in 6th floor are very caring. The process is very fast comparative to other hospitals.", "label": "positive"}
{"text": "Dr Manisha Rajpal Singh She is very smart. We really appreciate her kindness and compasionate!", "label": "positive"}
{"text": "She hold the skill necessary for those who suffer with endometriosis. Her Flexibility to adapt to the treatment. She give us courage!", "label": "positive"}
{"text": "This feedback is the expression of my gratitude and experience which may be benefit for the patients and their families.", "label": "positive"}
{"text": "Hospital services are very good. Extremely well maintained Hospital with a terrific team of doctors with a humane approach towards patients, who leave no stone unturned for a patient and stand by you on the journey to recovery.", "label": "positive"}
{"text": "Overall had a very good experience and feel at home. Every staff have taken a great care of me. I'm very grateful to all the staff who has helped me recover, by treating me with utmost care.", "label": "positive"}
{"text": "Fortis is a much reliable hospital, where every patient who visits the hospital is treated like a family. Wish the team a grand success, a bright future and good speed.", "label": "positive"}
{"text": "My entire pregnancy experience at Fortis was phenomenal. From prenatal to delivery , my experience of being a first time mother was made the most memorable experience. Thank you , Gayatri D Kamath and team for making the happiest day of my life even better !!", "label": "positive"}
{"text": "Excellent service. Everything is well taken care of by the staff here. Food is also good. Very neatly maintained rooms. I am fully satisfied with the treatments and hospitality at this hospital. Thank you so much Fortis Team.", "label": "positive"}
{"text": "Dr. Sheela is a very professional and experienced doctor. Good facilities and the staff is good too. However, during insurance clearances you may have to face a little issue. Overall very good hospital with great facilities.", "label": "positive"}
{"text": "Dr Raju sir and team are very good, and the service of all Staff members is very good. Facilities in hospital are excellent and accurate.", "label": "positive"}
{"text": "Had come for ear surgery for my brother under Dr Athira Ramakrishnan. She had given excellent treatment.", "label": "positive"}
{"text": "She had an effective communication with the patient and explained everything thoroughly. The nursing services were really good, being available all the time around. Very happy with the services given by the supporting staffs as well. All the staffs performed their duties really well. Thank you all.", "label": "positive"}
{"text": "Recommended doctors and hospital for cardiac surgeries. Dr Vivek Jawali, Dr Murali Manohar, Dr Nikhil are excelkent team doctors. Suraksha, Alida, Aneesha, support staffs Are extremely good caring. Food is hygiene and timely.", "label": "positive"}
{"text": "Dr. Usha B R is very well experienced and knowledgeable. She treats patients as her friends. Build that confidence and bond with patients to make them comfortable.", "label": "positive"}
{"text": "Overall good experience with her. Daycare all nursing staffs are very caring and always available. Thanks to Dr. Usha and her team.", "label": "positive"}
{"text": "Dr. Shabeer Ahmed has provided prompt treatment and it helped me to recover. Nurses are also very good. They're very helpful and humble.", "label": "positive"}
{"text": "Very satisfied with Dr. S S Praharaj. Nicely we did my surgery. Super nursing staffs. From morning till night, they took care very efficiently. Once we press the call bell, they will always come immediately. Food and cleaning team always on time. Overall good service.", "label": "positive"}
{"text": "Dr. Usha B R is friendly and analysis the medical condition very efficiently. She's took care very well. Nursing staffs are very very cooperative special thanks to sister Shalini. We like the environment very much and hoping for the best results. Thank u all.", "label": "positive"}
{"text": "The treatment was very good from the hospital. They guided us in each and every step. The doctors including Gayathri kamat and Swetha mam are really good and caring. It was nice to get the treatment done at Fortis,", "label": "positive"}
{"text": "Dr. Sudha Vinod Menon is an amazing doctor. She has explained everything to us properly. All the nurses are very good and caring", "label": "positive"}
{"text": "My wife was admitted recently for an emergency while she is expecting. And we are extremely satisfied with all the services provided by doctors and nurses right from the emergency department till our discharge", "label": "positive"}
{"text": "Special thanks to Dr. Chaitra and Dr. Mangala for a thorough check-up and diligent treatment approach during this visit.", "label": "positive"}
{"text": "I visited Dr. Usha from gynecology department at Fortis bannerghatta. The diagnosis was apt and had to go though a minor surgery later. I was treated well by all the doctors and nurses, everyone was really corporative and helpful.", "label": "positive"}
{"text": "I am very thankful to this hospital and Dr for curing my father health problem with his skillful treatment. I really appreciate all the doctors teams and nursing staff for their commitment. Excellent service", "label": "positive"}
{"text": "Good hospitality & Services.", "label": "positive"}
{"text": "Great hospital with quality standards.", "label": "positive"}
{"text": "Dr. Chaya Patel is a very good doctor knowing her from 10 years. Polite and experienced.", "label": "positive"}
{"text": "Diagnosis, treatment and care are good. It is a big organisation and a large team of doctors and supporting staffs doing a decent job! Cost is bit on the higher side. A cot could be provided for attenders in general ward. Discharge process was not smooth.", "label": "neutral"}
{"text": "The ward was also very clean and well maintained (we had chosen a twin sharing room).", "label": "positive"}
{"text": "The pulmonologist team did a very thorough diagnosis and suggested the best course of treatment.", "label": "positive"}
{"text": "It is a big organisation and a large team of doctors and supporting staffs doing a decent job! Cost is bit on the higher side.", "label": "positive"}
{"text": "They were a great support during the difficult times Night staff were exceptional always running to peopleâ€™s aid I felt they were overloaded with work.", "label": "positive"}
{"text": "Over all great service and support All of staff members were awesome people.", "label": "positive"}
{"text": "Aster hospital has the latest systems and techniques The hospital is very clean and well maintained.", "label": "positive"}
{"text": "I wholeheartedly recommend them to anyone in need of cardiac care Their combination of medical expertise and genuine compassion is truly remarkable", "label": "positive"}
{"text": "They are Master's in Consultation Treatment Lab Services and Car Special thanks to Emergency ICU Insurance and Security Teams.", "label": "positive"}
{"text": "Overall helpful staff and good service.", "label": "positive"}
{"text": "Crowd management can be improved and nursing support staff can be increased in departments", "label": "neutral"}
{"text": "Worst hospital Only because of good doctor we came here except that each and every thing here is worst.", "label": "negative"}
{"text": "Aster CMI is One of the best hospital with good facilities and the top consultants in the south India.", "label": "positive"}
{"text": "I would strongly recommend this hospital to whoever wants top class treatment and best administrative services.", "label": "positive"}
{"text": "One of the best hospital with good facilities We had taken full body checkup for both Really good staff and friendly staff", "label": "positive"}
{"text": "We were in the general ward and there was no nurse call option provided", "label": "negative"}
{"text": "Admitted for dengue treatment under doctor brunda madam doctor treated very well and helped me to get platlets improvement within a short time", "label": "positive"}
{"text": "I got a positive vibes while leaving the hospital they provided get well soon card for me Excellent service treatment.", "label": "positive"}
{"text": "If you have enough money then you can choose this hospital There is no limit on looting patients here.", "label": "neutral"}
{"text": "For hospitization below is feedback Senior Doctors are good Jr Doctors are not sharing or responding for any queries", "label": "neutral"}
{"text": "Nurse station support is very poor we have to follow up for everything.", "label": "negative"}
{"text": "They just say wait doctor will come or test will start no proper data they have.", "label": "negative"}
{"text": "Fantastic treatment doctor nagamalesh sir removed two blocks successfully and he made me very comfortable procedure time awesome support.", "label": "positive"}
{"text": "Dr somshekar is the best He gave my mom a second life.", "label": "positive"}
{"text": "Staff are friendly and excellent in whatever service they render.", "label": "positive"}
{"text": "This is an extremely expensive hospital which cannot be afforded without insurance.", "label": "neutral"}
{"text": "In patient care was great during the first few days Nursing team was very fast to respond and very friendly.", "label": "positive"}
{"text": "Regular visits by the doctors Excellent house keeping.", "label": "positive"}
{"text": "The food takes a very long time to get delivered Food is again on the expensive side.", "label": "negative"}
{"text": "A lot can improve in this place to make the experience great.", "label": "neutral"}
{"text": "Itâ€™s been 7 months since the accident now and Iâ€™m back on my feet Thanks to Aster CMI for their good healthcare.", "label": "positive"}
{"text": "The registration experience was quick and hassle free The diagnostic labs are good too.", "label": "positive"}
{"text": "Overall it is a good and clean hospital which makes it one of the most favorite hospitals for locals and international patients.", "label": "positive"}
{"text": "The doctors are the best in the city along with great infrastructure makes this a preferred hospital for all.", "label": "positive"}
{"text": "Had a very good experience with the hospital doctor Dr Brinda Dr Lokesh and surgeon Dr Santosh nu neuro.", "label": "positive"}
{"text": "I was really happy and fully satisfied with the Pre Surgery preparations/ Surgery operations & post surgery care.", "label": "positive"}
{"text": "My experience with the hospital was good overall.", "label": "positive"}
{"text": "The hospital has good infrastructure and facilities.", "label": "positive"}
{"text": "When it comes to doctors they do have lots of well experienced and knowledgeable doctors.", "label": "positive"}
{"text": "Special mention to exceptional nursing and other medical & non medical staff who were very caring and checking on the kid every now and then.", "label": "positive"}
{"text": "Especially Mr Rajesh took care of mother like anything Whenever whatever we asked he had helped and arranged Great job", "label": "positive"}
{"text": "I recently had a positive experience at Aster CMI Hospital.", "label": "positive"}
{"text": "I am so glad that we got a kidney transplant done for my wife in Aster Hospital I can say the best hospital with superb service.", "label": "positive"}
{"text": "Overall the hospital has been following good maintanence and cleaning of the wards to ensure hygiene.", "label": "positive"}
{"text": "Visited the medical oncology department The consultation process was smooth Staff were polite and helpful.", "label": "positive"}
{"text": "Overall it was good treatment wise and the services Were also really good.", "label": "positive"}
{"text": "The entire Gynac department including fetal medicine OPD staff labor wards and nurses worked very efficiently and effectively throughout the time.", "label": "positive"}
{"text": "My wife was given a complimentary massage post delivery which speeded up her recovery and was very relaxing for her.", "label": "positive"}
{"text": "The staff also organised a surprise cake cutting for us as part of the celebration.", "label": "positive"}
{"text": "The admission process was remarkably smooth reflecting the hospital's commitment to efficiency and patient comfort.", "label": "positive"}
{"text": "The staff mainted high level of professionalism and compassion making me feel well-cared-for throughout my stay.", "label": "positive"}
{"text": "I Had good experience with Dr sanjay Bhatt who gives time for patients to understand their problem and provide the right medication and suggestion.", "label": "positive"}
{"text": "All good treatment from pediatric surgery team.", "label": "positive"}
{"text": "Aster has been the place for all my medical needs They have one of best medical care that you can ever get.", "label": "positive"}
{"text": "The staff are caring and one of the most efficient hospital I have ever visited.", "label": "positive"}
{"text": "I had some issues in bed assignments probably due to patient load on the hospital.", "label": "neutral"}
{"text": "The Nurses did an excellent job especially Manjari Payal and Moushmi who always attended with a smile when needed.", "label": "positive"}
{"text": "I believe the hospital is expensive compared to others.", "label": "neutral"}
{"text": "the cost of hospital is more.", "label": "neutral"}
{"text": "I would not like to recommend this hospital to anyone because of the bill they prepare at the time of discharge.", "label": "negative"}
{"text": "I had a single private room but was not cleaned and the staff was very rude", "label": "negative"}
{"text": "the food is not tasty and is not made well This can definitely improve", "label": "negative"}
{"text": "my wife during the treatment Got great support from the overall medical team.", "label": "positive"}
{"text": "Only concern is with the admission process and canteen It needs to be improved.", "label": "neutral"}
{"text": "Came to the Radiology department for my wifeâ€™s MRI and CT Scan it was done in a quickly and very positive way.", "label": "positive"}
{"text": "I am extremely happy the way she is helping me in my weight loss journey.", "label": "positive"}
{"text": "I requested to provide more staff in general ward.", "label": "neutral"}
{"text": "The nurses staffs food service general ward rooms facility were excellent.", "label": "positive"}
{"text": "Admitted one day for the medical observation 1 week before delivery All process again was very smooth.", "label": "positive"}
{"text": "All producers has been taken very carefully and neat and smooth.", "label": "positive"}
{"text": "Shridhara s from nursing team has given immense support and happy for him.", "label": "positive"}
{"text": "Gynecologist Bhavani madam is good treating communication and treatment all is v good", "label": "positive"}
{"text": "the poor can't afford this hospital in my opinion If you have medical insurance then it's easy.", "label": "neutral"}
{"text": "To the neuro ICU nurses 5th floor nurses (shout to Samima and Full) thank you You did a great job.", "label": "positive"}
{"text": "Everything is so well coordinated I am definitely a happy patient.", "label": "positive"}
{"text": "staff and nurses are quite arrogant and rude they are not at all punctual and I believe if there was a serious emergency they would still come late.", "label": "negative"}
{"text": "the amount we are paying is not worth it at all.", "label": "negative"}
{"text": "My baby got admitted in hospital and the treatment was good as well as security were kind and polite especially Sangeeta and Shraddha.", "label": "positive"}
{"text": "staff and Nurse services is worst we are only to beg to treat patient and inform to give tablets to patient.", "label": "negative"}
{"text": "Many other doctors and support team has helped us to over come this situation.", "label": "positive"}
{"text": "if the nurses donâ€™t know how to do their job they shouldnâ€™t be allowed to work near a patient.", "label": "negative"}
{"text": "Hospital is very clean and good and doctor Mr Ravikumar C P is treats our baby within 3days our baby felt better and she became active.", "label": "positive"}
{"text": "One of the best hospital and good response from Dr I m happy to the service and securities Nice to see they are Communication with attendees.", "label": "positive"}
{"text": "Staff is prompt in their services Excellent team Special thanks to Venamma Taken good care clean place.", "label": "positive"}
{"text": "Very bad experience.", "label": "negative"}
{"text": "people who handle insurance are VERY CARELESS They donâ€™t even bother about the tension and emergencies of the patient.", "label": "negative"}
{"text": "They always give WRONG communications This is really a very sad part about the hospital.", "label": "negative"}
{"text": "We are very happy about the treatment provided technology and doctors advice and concern towards patients in ASTER CMI HOSPITAL.", "label": "positive"}
{"text": "Worst Experience in Aster CMI hospital", "label": "negative"}
{"text": "She was exceptionally well in handling patients By her soothing words she made worried patients comfortable.", "label": "positive"}
{"text": "They are misleading people by not informing about the terms and conditions properly.", "label": "negative"}
{"text": "The surgery went really well and the recovery is nice as of now.", "label": "positive"}
{"text": "Worst hospital to follow up Even tried walkin appointment but doctor will not take walkin people.", "label": "negative"}
{"text": "Nursing care given by nurses during all the shifts was good.", "label": "positive"}
{"text": "The support service team was also good in their work Overall the experience was really good and once again thanks to the entire aster team", "label": "positive"}
{"text": "Worst hospital and management", "label": "negative"}
{"text": "The staff is not at all helpful and do not give clear instructions", "label": "negative"}
{"text": "I also waited for one hour with a confirmed appointment and the lady at the reception was very very rude", "label": "negative"}
{"text": "This has been the worst experience with a hospital across India", "label": "negative"}
{"text": "Many thanks to all Staff Even they celebrated my daughter's birthday & senior doctor Harish also participated in it.", "label": "positive"}
{"text": "The other services are good but REHAB is horrible please rectify this fault.", "label": "neutral"}
{"text": "Horrible food Worst food among all the hospitals I know of in Bangalore.", "label": "negative"}
{"text": "Very unresponsive housekeeping staff They will come to clean and replace the sheets at 5 am when the patient is sleeping", "label": "negative"}
{"text": "Exhaust fan in the bathroom was not working This is safety issue if you have to use the bathroom after another sick patient.", "label": "negative"}
{"text": "Overall the hospital is very expensive for the kind of services and amenities provided.", "label": "positive"}
{"text": "I could easily say Aster CMI is the best hospital for children in entire Bangalore.", "label": "positive"}
{"text": "Dr Sapna Lulla was very nice everything was very smooth.", "label": "positive"}
{"text": "Very convenient good parking space Fast service in the reception Well educated / experienced doctors Lab test on time.", "label": "positive"}
{"text": "They took care of everything and made the patient feel absolutely comfortable.", "label": "positive"}
{"text": "I expect more professional attitude from the staffs We meet two doctors both are busy and allow less time for us.", "label": "neutral"}
{"text": "I really liked the overall experience The senior doctors are really qualified and accurate in their diagnosis/treatment.", "label": "positive"}
{"text": "taking good care of the patient food service.", "label": "positive"}
{"text": "Hospital is very good and quick treatment Satisfied with facility.", "label": "positive"}
{"text": "My respect and appreciation for all the nurses very caring Well done Aster.", "label": "positive"}
{"text": "Support service team has also have done their work nicely.", "label": "positive"}
{"text": "We had one of the best services provided by the all the doctors and nursing staff specially trivani sister was the best at her service.", "label": "positive"}
{"text": "We are very much satisfied with the treatment During her stay in the hospital the Nursing staff", "label": "positive"}
{"text": "The staff were very friendly and helpful", "label": "positive"}
{"text": "I highly recommend Aster hospital for great patient care.", "label": "positive"}
{"text": "The whole neurosurgery team is excellent and awesome Special thanks to Dr Nirmala and all other doctors at ICU who took care of me", "label": "positive"}
{"text": "All nursing staff and other staffs also co operated and took good care of us.", "label": "positive"}
{"text": "All the staff reception were very kind and responsive They were guiding me properly with the procedure", "label": "positive"}
{"text": "I am very happy with the service provided thank you", "label": "positive"}
{"text": "Manjari from canteen gave a good service to us She keeps the food on time.", "label": "positive"}
{"text": "All over good service from hospital and staff Thank you Very much Aster CMI Hospital and staff.", "label": "positive"}
{"text": "Never seen this bad house keeping Even after multiple request they don't provide what is asked.", "label": "negative"}
{"text": "And the scanner bar code they have pasted everywhere for feedback link doesn't work.", "label": "neutral"}
{"text": "We had a wonderful experience at Aster CMI Hospital during our medical visits for my father", "label": "positive"}
{"text": "All are cooperative and helpful Treatment is great and hospital is good.", "label": "positive"}
{"text": "The sisters here also take good care of patients and are polite to attenders.", "label": "positive"}
{"text": "CCU security Mamatha is very polite and speaks multiple languages and is very friendly.", "label": "positive"}
{"text": "The facilities here are very good and you get the confidence that you will get treated well once you are here and go back healthy.", "label": "positive"}
{"text": "the tests are very expensive and without insurance this will burn a hole in your pocket", "label": "neutral"}
{"text": "I am extremely impressed with the services offered at Aster cmi Hospital.", "label": "positive"}
{"text": "The facilities were modern and well-maintained creating a comfortable environment for patients", "label": "positive"}
{"text": "I am immensely grateful for the positive experience and excellent medical care provided by Aster cmi Hospital", "label": "positive"}
{"text": "We are very happy with the experience and will be grateful forever.", "label": "positive"}
{"text": "Thanks for the hospital we got good treatment.", "label": "positive"}
{"text": "The patient gets hope and has complete faith that they will get treated and keep in good health.", "label": "positive"}
{"text": "I'm happy to choose to this hospital thank you so much everyone for you all good supporting", "label": "positive"}
{"text": "Takes lots of time to give report.", "label": "positive"}
{"text": "they were really patient friendly and nursing care was really excellent.", "label": "positive"}
{"text": "Aster hospital is excellent in Bangalore with all good services All are good and helpful.", "label": "positive"}
{"text": "Nursing staffs are very lazy", "label": "negative"}
{"text": "Floor coordinator John was very helpful and security ayang also very good.", "label": "positive"}
{"text": "Worst working professional.", "label": "negative"}
{"text": "doctor Akshay sir and Pavan Kumar is kind good person he will treat the patient very nicely", "label": "positive"}
{"text": "the dining area is not maintained well dining area is too small.", "label": "neutral"}
{"text": "We are very much satisfied with his treatment he explained us the treatment we understood well.", "label": "positive"}
{"text": "There are multiple waiting rooms and cafes The hospital is very clean", "label": "positive"}
{"text": "Mamatha is very polite and speaks multiple languages and is very friendly Overall good service", "label": "positive"}
{"text": "We shall refer others as we are totally satisfied by the care and hospitality.", "label": "positive"}
{"text": "Today its our discharge and we are happy to leave from here.", "label": "positive"}
{"text": "Thanks to Dr Umesh and team All other doctors siters and staff are come operative and supportive We are thankful for the treatment.", "label": "positive"}
{"text": "Medications and nursing staffs are very good and co operative we had a good experience in the hospital", "label": "positive"}
{"text": "staff is rude specially nurses and billing staff they behave as if they own hospital", "label": "negative"}
{"text": "they do not treat in emergency ward so that patient doesnâ€™t get well till they become potential in patient or customer.", "label": "negative"}
{"text": "Thanks for the good treatment Nursing care its very good", "label": "positive"}
{"text": "Great hospital Amazing doctors Dr Sahana took such good care of me Nurses and staff were very attentive.", "label": "positive"}
{"text": "had delay with house keeping staff", "label": "negative"}
{"text": "Lakshmi was very helpfull in arranging the scan APPRECIATE ALL HER EFFORT", "label": "positive"}
{"text": "Housekeeping didnâ€™t respond for issues neither cared about our problems", "label": "negative"}
{"text": "Nurse Panchali in night duty very polite and friendly who makes patient to feel homely.", "label": "positive"}
{"text": "no emergency attenders are there.", "label": "negative"}
{"text": "No nurse or staff responded well or gave any first aid.", "label": "negative"}
{"text": "I had a very sensitive and caring experience with my dad", "label": "positive"}
{"text": "This is the first ever worst experience for us on the hospital.", "label": "negative"}
{"text": "Dr Rajini ma'am treated us very well Aster has best facility for the patients", "label": "positive"}
{"text": "The surgery was really good Everything went well He is doing good after surgery We are happy", "label": "positive"}
{"text": "Hospital infrastructure is extremely good.", "label": "positive"}
{"text": "Food given to patients and attenders during BMT was below average and did not meet nutritional requirements", "label": "neutral"}
{"text": "doctor was very arrogant and almost behaved like a hooligan People like him should not be a doctor", "label": "negative"}
{"text": "journey in this hospital went smoothly and we are very happy with her treatment and the friendly nature of the staff.", "label": "positive"}
{"text": "Staff from nursing to housekeeping were all really nice and professional.", "label": "positive"}
{"text": "Thank you all for your prompt actions which is leading the way for my aunts recovery.", "label": "positive"}
{"text": "They provide good and quality care Nurses are very friendly and equipments are good.", "label": "positive"}
{"text": "All doctors and staff are co operative Security Jyothi lakshmi has done good job.", "label": "positive"}
{"text": "very good about diet and she gave very good diet plan for my disease.", "label": "positive"}
{"text": "I had a good experience with aster staff Exclent doctors Nurses Lactation department Dietician Nursing aids", "label": "positive"}
{"text": "Very good treatment received Thanks to Sir Sri P R Dayanidhi and Ishika Security Ayang Madam from Arunachal", "label": "positive"}
{"text": "The nursing staff is very good and polite and we felt very comfortable Thank you very much for the all the support and care", "label": "positive"}
{"text": "overall good treatment and excellent doctor and nursing staffs.", "label": "positive"}
{"text": "Thanks to all doctors team Treatment is wonderful We are completely satisfied", "label": "positive"}
{"text": "Rude doctors Rude physiotherapists Rude staff Inexperienced nurses", "label": "negative"}
{"text": "The billing and admission department people have no heart and they are very rude.", "label": "negative"}
{"text": "The doctor who conducted my fatherâ€™s surgery was rude as well and spoke arrogantly with us.", "label": "negative"}
{"text": "Nursing staffs are also really in their care and treatment Support services team also was good.", "label": "positive"}
{"text": "Dr Nishta performed my colposcopy and biopsy so effortlessly made me feel very comfortable.", "label": "positive"}
{"text": "Thank you once again for your exceptional service and for making my ACL surgery experience a positive one.", "label": "positive"}
{"text": "Doctor treatment is good nurse caring is good and support services is very excellent.", "label": "positive"}
{"text": "If you don't have insurance please don't choose this hospital.", "label": "neutral"}
{"text": "Good working is housekeeping department room and restroom cleaning is nice especially Staff.", "label": "positive"}
{"text": "Dietician Aruna Devi explained very well we are very much satisfied with her counseling she had given diet plan very helpfull Thank you.", "label": "positive"}
{"text": "Doctor treatmentnurse curing and Cleaning department are very excellent especially hk staff.", "label": "positive"}
{"text": "Nursing service also good Thanks for over all Thank for Ortho team.", "label": "positive"}
{"text": "They have confirm me appointment for but nobody is responding.", "label": "negative"}
{"text": "It is a bad experience Overall.", "label": "negative"}
{"text": "The Doctor didn't had time to listen to my issues nor could explain to me on the treatment options", "label": "negative"}
{"text": "Complete failure of hospital management system and foundational patient communication training.", "label": "negative"}
{"text": "Very poor behaviour and attitude displayed by doctor Dr Ashwin Kr.", "label": "negative"}
{"text": "This is worst hospital In two months my father admitted thrice and yet doctor can not find out what is the issue.", "label": "negative"}
{"text": "Discharge procedures are so slow mainly because of the nurses due to lack of understanding and importance of patients.", "label": "negative"}
{"text": "And also Sister Leema was very helpful in explaining the insurance and was kind.", "label": "positive"}
{"text": "Diagnosis treatment and care are good It is a big organisation Cost is bit on the higher side Discharge process was not smooth.", "label": "neutral"}
{"text": "The ward was also very clean and well maintained.", "label": "positive"}
{"text": "My mother was treated by Dr Vivek Padegal and team The pulmonologist team did a very thorough diagnosis and suggested the best course of treatment.", "label": "positive"}
{"text": "Diagnosis treatment and care are good.", "label": "positive"}
{"text": "Amazing service", "label": "positive"}
{"text": "I'm very happy with this services.", "label": "positive"}
{"text": "Food quality at hospital needs improvement Otherwise excellent service from doctor and hexa buddies.", "label": "neutral"}
{"text": "Nirmala was co ordinated my son's case very knowledgeable and end end supported i strongly recommend to hexa health.", "label": "positive"}
{"text": "The timing of admission and discharge for insurance patients can be provided with more clarity.", "label": "positive"}
{"text": "Good service by dilip kumar", "label": "positive"}
{"text": "So worst experience.", "label": "negative"}
{"text": "the reception guys are worst They make you wait like hell.", "label": "negative"}
{"text": "Met Dr Sagar C in Pulmonology We are very grateful to him for his apt guidance Online appointment booking was helpful too parking was a challenge though.", "label": "positive"}
{"text": "The only great doctor that is available and genuine is Sujith MS If not for Sujith MS don't even visit this hospital.", "label": "neutral"}
{"text": "Went to Narayana hospital to visit obstetrician Dr Janani sarvanan She is literally a God totally invisible and forever unavailable.", "label": "negative"}
{"text": "Good service by Dr jagadish in helping us in resolving our issues dilip Kumar In co ordinating", "label": "positive"}
{"text": "Found excellent service by Rajeshwari from billling and MOD Soojanya I would extend my thanks for wonderful support and help.", "label": "positive"}
{"text": "Good service from erasree Peacefull hospital Patient will be recover fast.", "label": "positive"}
{"text": "Good service by dilip kumar.", "label": "positive"}
{"text": "Dr Sujith treatment is very good He will analyse disease from the report for better cure.", "label": "positive"}
{"text": "I really liked the service there Thanks to the Emergency doctor abhishek and Thanks to the security guard there.", "label": "positive"}
{"text": "Good hospital.", "label": "positive"}
{"text": "Good service by Dilip in helping us in consultation.", "label": "positive"}
{"text": "Was satisfied with test and time taken for that approximately she would have explained all details of the test conducted which did not only in 5 minutes she completed.", "label": "neutral"}
{"text": "Good service by dilip.", "label": "positive"}
{"text": "Emergency ward department is the worst The worst emergency department I have seen in Bangalore.", "label": "negative"}
{"text": "Overall service and response is very good", "label": "positive"}
{"text": "New Excellent Experience Thanks NH.", "label": "positive"}
{"text": "Good service by dilip Kumar in helping us finish the things faster at OPD", "label": "positive"}
{"text": "Narayana should try and educate their employees on triage protocols because the service doesn't looks like that of a hospital.", "label": "negative"}
{"text": "This review isn't specially about the hospital per say I had booked an in-person appointment with her a few months ago to understand the risks and general consultation about sexual education and contraceptive precautions to take.", "label": "negative"}
{"text": "It was the first time I ever consulted a doctor by myself and frankly it was an ugly experience having her as my doctor that day.", "label": "negative"}
{"text": "I feel compelled to share my recent experience at your hospital and unfortunately it was far from satisfactory.", "label": "negative"}
{"text": "the worst hospital ever in the world. please if you are in an emergency or even not in an emergency situation", "label": "negative"}
{"text": "There service is so ridiculous.", "label": "positive"}
{"text": "No response to any query even when it is their mistake They just keep repeating the same mistakes and at the end it is the patients fault.", "label": "negative"}
{"text": "It was am amazing experience and team at the counter were very co operative and helpful in all my requirements at hospital. Thnx", "label": "positive"}
{"text": "Dr pratibha Dermatology Dr was very good", "label": "positive"}
{"text": "We had a great experience at the hospital Dr Amarnath Reddy Sir is a genious personality and a very caring doctor.", "label": "positive"}
{"text": "Worst hospital the people inside were so rude and not ready to treat the patient itself think before visiting this hospital.", "label": "negative"}
{"text": "I went to Narayan Hospital for the first time with my father I want to share some experiences I really liked the service there Thanks to the Emergency doctor abhishek.", "label": "positive"}
{"text": "They have expert doctors who gives the right medicines and helps the patients recover fast medical tests and getting the required medicines from pharmacy .", "label": "positive"}
{"text": "Patient friendly Taking good care for the patient and giving first preference Much satisfied throughout 10 months journey Thanks once again.", "label": "positive"}
{"text": "Hi thank you for rating us 5 stars We're glad to know that you had a positive experience in our care Take Care Team Narayana Health.", "label": "positive"}
{"text": "He will analyse disease from the report for better cure His medication always effective the good doctor for cold asthama fever and any alergy related to throat And also support of Narayani hospital is very good.", "label": "positive"}
{"text": "5 star for Dr Manjula HM She has been super supportive and caring throughout my pregnancy and ensured normal delivery She is wonderful professionally as well as personally compassionate and humble attitude is a cherry on the top.", "label": "positive"}
{"text": "I had an amazing experience with Dr Manjula HM in Narayana Hospital HSR She was very patient with me and helped me out during all my medical emergencies The hospital also provided all the facilities and support needed.", "label": "positive"}
{"text": "Very very clean hospetal Dr Abhinav sir so great nice speak he explained everything about my son health issues in a very clear manner.", "label": "positive"}
{"text": "I had performed an endoscopy test and found the experience to very very managed and performed by skilled empathetic fixture and hospital staff Overall a very comfortable and professional experience.", "label": "positive"}
{"text": "I visited to this hospital to consult with Dr Karthik S N General medicine I had a very good experience Hospital is also providing good services term of assessment appointment treatment consultation.", "label": "positive"}
{"text": "At the outset I thank sister Shireen in the OPD who yesterday helped to book appointment with Dr Vijay as being supersenior citizen I am ignorant of booking an appointment online Kindly restore our old type of booking.", "label": "positive"}
{"text": "having taken personal care to treat me well and advising further investigations They were carried out by the lab and USG today utmost care and the staff Sharmila and Anu Gowda for all the help extended me.", "label": "positive"}
{"text": "I have visited to take my second dose and Process was really smooth Hospitality from all staffs are really appreciable Shanti tooks good care and provide all details before vaccination Thank you.", "label": "positive"}
{"text": "I had consultation with Dr Saji regarding my father's hip injury It was really good experience to have a clear understanding of issue and appropriate recommendation for treatment.", "label": "positive"}
{"text": "This is a very good hospital Very nice Doctors and good treatment Worth of money charged Hygienic and good facility.", "label": "positive"}
{"text": "I was very impressed with the Doctor and the staff was friendly and helpful I was able to get an appointment She took the time to answer all of my questions and I felt confident in her ability to help me.", "label": "positive"}
{"text": "Sample collection on time prompt punctual attentive and courteous Nursing well attending care giving minutely attentive Doctors detailed well explainingand guiding Specialist.", "label": "positive"}
{"text": "Minutely detailing eliciting and patiently hearing patient infirmation and clear instructions Cost reasonable.", "label": "positive"}
{"text": "Treatment is really awesome But the fees you are charging is really very high normal person cannot afford it please do some concession for middle group people.", "label": "positive"}
{"text": "Was suffering from severe throat pain for 5 days Consulted Dr Ria ENT specialist To my surprise the pain almost gone in 8 hrs after taking meds suggested by her Dr Ria even suggested how I can fix my sleeping problem.", "label": "positive"}
{"text": "I had been visited the hospital last week It's an imagine hospital Everybody is very helpful Especially Mrs Runa Das She is very much helpful and very cooperative I never forget her help during my visit.", "label": "positive"}
{"text": "It was am amazing experience and team at the counter were very co operative and helpful in all my requirements at hospital Thnx Positive", "label": "positive"}
{"text": "Visited Naraya hrudayalaya for health checkup during the weekend Usually very crowded and took around 5 6 hours for complete routine checkup Staff is supportive and cleanliness is maintained.", "label": "positive"}
{"text": "Good service by dilip Kumar in helping us finish the things faster at OPD.", "label": "positive"}
{"text": "I have consulted Dr Karthik sir I would say one of best doctor near HSR He do systematic examination no hurry explains issue calmy and won't suggest unnecessary test.", "label": "positive"}
{"text": "Nowadays I have seen doctor they won't even touch patient and never use sethoscope ask everything to patient and write down some tablets But Karthik sir do through examination and treat patient Thanks you Sir.", "label": "positive"}
{"text": "Must come for any cardio issue they are Titans for cardio health Thank you NH team from ground handling staff to doctors all are superb in their assigned job! Kudos to the organization.", "label": "positive"}
{"text": "The hospital will not take you for a ride with unwanted tests .", "label": "positive"}
{"text": "The doctors do physical examination and with the symptoms findings and their experience proceed with medication.", "label": "positive"}
{"text": "Thank you doctor and NH hospital.", "label": "positive"}
{"text": "Dr Ramesh Patil examined me carefully and satisfied by all means as an expert neurologist! He impressed deeply with his cool behaviour.", "label": "positive"}
{"text": "Good service from erasree Peacefull hospital Patient will be recover fast", "label": "positive"}
{"text": "Doctors and staff are very supportive and helpful This is my first visit to HSR LAY OUT HOSPITAL I am amazed.", "label": "positive"}
{"text": "Wonderful experience had a consultation with the doctor and was advised very well Umair assisted a lot he was very helpful and very patient friendly.", "label": "positive"}
{"text": "A solid money minting business factory Half and hour dressing job done in 2 hours and hence bill of 500 easily escalated to 2000.", "label": "negative"}
{"text": "Good and clean hospital.", "label": "positive"}
{"text": "There is great team of doctors and good OT facility The medical facilities are all great with good inpatient post operative care by doctors nurses.", "label": "positive"}
{"text": "The housekeeping staff is also good but they can respond to calls from the room a little faster.", "label": "neutral"}
{"text": "The admin accounts department are very unprofessional with discharge and insurance calim settlement Had a really bad experience during discharge. They need to be sensitive and more transparent towards the patient and his her family.", "label": "negative"}
{"text": "The parking is very limited with space for 10 15 cars with lot of bird droppings falling on the car.", "label": "neutral"}
{"text": "The streets next to the hospital are narrow and can be conjusted so better to avoid the street next to hospital.", "label": "neutral"}
{"text": "Cars can be parked on the nearby streets is hospital parking is unavailable.", "label": "neutral"}
{"text": "The staff are very friendly Although it was a walk-in appointment I did not have to wait for a long time Dr Saji is my most favoured Doctor He is so humble kind and caring.", "label": "positive"}
{"text": "the worst hospital ever in the world.", "label": "negative"}
{"text": "please if you are in an emergency or even not in an emergency situation don't ever come here.", "label": "negative"}
{"text": "they don't know how to be professional and treat their patients for just a report they took 2hrs to give.", "label": "negative"}
{"text": "i request each and every person not to come here please save your time and energy.", "label": "negative"}
{"text": "Hospital doctors are not good.", "label": "negative"}
{"text": "They are giving medicine and asking for lot of testing by only guessing as they are not experienced For me they asked lot of testing but not able to find out why I am getting mild fever in evening Better I do check up in Sakara or Manipal.", "label": "negative"}
{"text": "If you are visiting this hospital visit at your own risk For major tests they will get a declaration signed by you before test to relieve themselves of all responsibilities and then your life is in the hands of incompetent people.", "label": "negative"}
{"text": "There service is so ridiculous No response to any query even when it is their mistake They just keep repeating the same mistakes and at the end it is the patients fault.", "label": "negative"}
{"text": "Had the worst experience ever here Took mys sister here she was having black outs .", "label": "negative"}
{"text": "Overall average services They give only 1 followup free When a doctor prescribes any health checkups then you need to take another paid booking to show your reports to the doctor The admin and billing counter staff are very rude and unprofessional.", "label": "neutral"}
{"text": "Good service", "label": "positive"}
{"text": "Hospital doctors are not good", "label": "negative"}
{"text": "I visited Narayana Multispciality Hospital at HSR Layout and it was a surprisingly pleasant experience.", "label": "positive"}
{"text": "The staff was helpful enough to guide me all throughout the time I spent at the hospital The waiting time for the check-up was not very long and the doctor was very good He took the time and had the patience to explain everything about my problem.", "label": "positive"}
{"text": "I was given a proper diagnosis and all my symptoms were taken into consideration The cafeteria was good and on ground floor they have cafe coffeday.", "label": "positive"}
{"text": "The entire hospital is very clean and very well maintained with staff to help out with any doubts that you might have It is definitely recommended if someone is looking for proper care.", "label": "positive"}
{"text": "Olny issue is there was long queue at the reception on early morning.", "label": "neutral"}
{"text": "I was very impressed with the Doctor and the staff was friendly and helpful I was able to get an appointment quickly.", "label": "positive"}
{"text": "I would highly recommend Narayana Hospital.", "label": "positive"}
{"text": "Worst Emergency service I have ever seen.", "label": "negative"}
{"text": "I have never seen a hospital outright deny a patient support Is it because they are understaffed at the emergency unit? I donâ€™t know Anyway I had to go to another hospital nearby where they immediately took me to a room to dress up my injury.", "label": "negative"}
{"text": "When to the OPD section the staff there prioritise their own people for the doctors visit Inspite of taking appointment was made to wait for 2 hrs and the staff there was prioritising the medical reps and other agents.", "label": "negative"}
{"text": "Worst Emergency service I have ever seen I kept waiting for more than 3 hrs to get IV Injection The hospital does not have separate facility to provide IV injection or other similar kind of operations.", "label": "negative"}
{"text": "I do not recommend this hospital at all Please think twice before going to Narayana Hospital HSR layout.", "label": "negative"}
{"text": "prompt punctual attentive and courteous well attending care giving minutely attentive Cost reasonable.", "label": "positive"}
{"text": "No support for patients after consultation hour only you can talk to doctor if you book a appointment Being regular visitor also not helpful Doctor is good but Naryana HealthCare hospital is bad.", "label": "negative"}
{"text": "Most pathetic clinic I would say They did X-ray unnecessary and most importantly they told me I have infection in lungs When checked with other doctor it was all good Not recommended at all.", "label": "negative"}
{"text": "This is an emergency case and you would at least expect one person to be sent inside with the patient just for an emergency situation but they wonâ€™t 1 star for hospitality here.", "label": "negative"}
{"text": "Treatment is really awesome", "label": "positive"}
{"text": "They asked me to come after 2 days to show to the orthopedician and when I came for the same they are treating me as new patient asking me to book an appointment with the orthopedician and wait for slot.\"", "label": "negative"}
{"text": "Matter is not specifically the money it is the attitude or gesture which hurts the tensed patients.", "label": "negative"}
{"text": "We had booked an eye consultation with Dr Vinay Patil but some other dr checked us under his name and didn't give eye no. also, he then redirected us to Sankalp Nethralaya hospitaloverall eye checkup experience was very bad.", "label": "negative"}
{"text": "One good thing about this hospital in comparison to other ones is the responsiveness of the all staff though there are delays.", "label": "neutral"}
{"text": "One if the worst experiences I had today.", "label": "negative"}
{"text": "It was overall good experience Doctor and Management from NH were supportive Bajaj Finserv came as saviour when our claim from insurer got rejected me to get the process done with no glitches.", "label": "positive"}
{"text": "Good service by Dr jagadish in helping us in resolving our issues dilip Kumar In co ordinating.", "label": "positive"}
{"text": "another worst experience simply people be there and many things not available i don't know what the pharmacy manager do there not doing their job properly i has this experience many times.", "label": "neutral"}
{"text": "Treatment and other services are good They will charge more for emergency services during night In house canteen for and food service for patients admitted is not good Iâ€™m disappointed with their timely service.", "label": "neutral"}
{"text": "Very poor bad worst experience For a hairline fracture as per doctor Due to unwanted plaster cast for 2 months I made my leg underperformer else i was fit for running I asked Doctor to show me the crack in CT report He refused. \"", "label": "negative"}
{"text": "If you are choosing this hospital for treatment or surgery then please do it at your own risk they are really good unless you admit and get your treatment started.", "label": "negative"}
{"text": "I had been visited the hospital last week It's an imagine hospital Everybody is very helpful Especially Mrs Runa Das She is very much helpful and very co-operative I never forget her help during my visit.", "label": "positive"}
{"text": "Recently visited this hospital Doctors are extremely good but the management and the service provided by the staff is worst Vitals checking persons are very careless.", "label": "negative"}
{"text": "Visited Naraya hrudayalaya for health checkup during the weekend Usually very crowded and took around 5-6 hours for complete routine checkup Staff is supportive and cleanliness is maintained.", "label": "positive"}
{"text": "I would have given 0 if there is an option I took my father to emergency ward and we waited 2 hours no body attended him at all What is the purpose of emergency if you dont have anyone to treat patient.", "label": "positive"}
{"text": "Worst hospital in Bangalore only money making market As soon u go to emergency ward u will end up going to ICU & all the hospital diagnostics are used to make moneyr.", "label": "negative"}
{"text": "I have consulted Dr Karthik sir no hurry explains issue calmy and won't suggest unnecessary test.", "label": "positive"}
{"text": "Must come for any cardio issue they are Titans for cardio health! Thank you NH team from ground handling staff to doctors all are superb in their assigned job Kudos to the organization.", "label": "positive"}
{"text": "The hospital will not take you for a ride with unwanted tests The doctors do physical examination and with the symptoms findings and their experience proceed with medication.", "label": "positive"}
{"text": "Hospital staff is very irresponsible Their behaviour is not good They are taking so much time for small treatment This hospital is not good for major injury and in emergency.", "label": "negative"}
{"text": "One of the rare hospital brands in bangalore which still keep the dignity of this profession The hospital management system is efficient and the staff helpful The doctors are competent.", "label": "neutral"}
{"text": "Dr Sujith MS has been very helpful during every visit at NH hospital Thank you doctor and NH hospital.", "label": "positive"}
{"text": "Dr Ramesh Patil examined me carefully and satisfied by all means as an expert neurologist He impressed deeply with his cool behaviour.", "label": "positive"}
{"text": "Worst hospital don't go here Never recommending this hospital to anyone Instead go to Apollo or some other hospital that have more sense that you shouldn't keep the patient waiting.,Negative,2 Service is excellent but charges are extremely high compared to Apollo 24/7 for lab reports,Positive ,5 This place is open just for minting money. It is so obvious in their behaviour. They manipulate test results in their favour so you can get admitted where no admission is required at all. This has happened to my uncle and a neighbor. ,Negative,2 Doctors and staff are very supportive and helpful. This is my first visit to HSR LAY OUT HOSPITAL. I am amazed.,Negative,1 First don't admit your loved one here. Chutiya hospital, can't diagnose or find anything even after 3 days of icu admission with lots of repetitive tests. Can't cure even dengue despite admitted on very first day of fever.", "label": "negative"}
{"text": "With the excellent support guidance and supervision of Dr Manjula Gynaecologist in Narayana Multi-speciality Hospital HSR layout surgery for my wife went on well and smooth.", "label": "positive"}
{"text": "Worst hospital please never go to this hospital in emergency ward they are just money looters and they just want all patients to go to ICU .", "label": "negative"}
{"text": "Very good service and good doctors Only challenge is with Parking With patient of u r alone it is a big challenge Also the location is such you hardly get a proper parking.", "label": "neutral"}
{"text": "examined me carefully and satisfied by all means as an expert neurologist! He impressed deeply with his cool behaviour.", "label": "negative"}
{"text": "The Hospital offers great patient care but the roads are very very Narrow and highly impossible to get parking available here or in the vicinity.", "label": "neutral"}
{"text": "Very good experience The doctor has addressed my health issue very patiently and I had quick recovery.", "label": "positive"}
{"text": "This is a second time we visited here this time we have done a surgery from here Doctors and nurses are very professional and helpful.Hospital promises clean and services very good Hope a good future ahead Thank you.", "label": "positive"}
{"text": "Emergency is a joke here They have been asking us to just wait and wait The concerned patient has very high fever with dengue Multiple payments .", "label": "negative"}
{"text": "I really wish and hope that someone from the upper management reads this You guys have everything available yet the hospital will never achieve any greatness And it'll be on you.", "label": "neutral"}
{"text": "Prompt service v good housekeeping disciplined nursing above all expert doctors well managed OT facilities.", "label": "neutral"}
{"text": "Fantastic medical care+ highest degree of professionalism awesome peace of mind for the patient n family Keep up the good work.", "label": "positive"}
{"text": "A very well managed medical superspeciality with hassle free assistance to patients and their family A must recommended to citizens.", "label": "positive"}
{"text": "Recently i had a fracture in my right hand. I went to Narayana hospital Hsr to get diagnosed by one of the best doctor .", "label": "positive"}
{"text": "Worst worst Gives good suggestion And the staff were good at patients Eerashi and Arun sisters were helpful to the patients I was forced by them to post good opinion but it was worst", "label": "neutral"}
{"text": "Hears your issues and addresses them Staff are absolutely dears Soft-spoken and helpful Billing needs improvement.", "label": "positive"}
{"text": "Last l was visiting the hospital very experienced Doctor is there specially Dr.Guddu and Miss Anu Thanks.", "label": "positive"}
{"text": "One of best hospital in Bangalore Doctors and staffs are very polite with the patient and understanding the problem and giving best treatment Also the maintenance of hospital with clean neat and tidy.", "label": "positive"}
{"text": "I have an excellent experience with with the service the provided and also Dr Sujit is a very good doctor.", "label": "positive"}
{"text": "THEY LET THE EMMERGENCY PATIENT TO DIE I took my 65yr mom as she keep complaining about chest pain i told them we are here for EMMERGENCY showing mom feeling breathless.", "label": "negative"}
{"text": "Dr Saji M J have been consulting him from past 4 years one of the finest doctor to be known and also a good human being.", "label": "positive"}
{"text": "The session with Dr Jagadeesh as very insightful He patiently answered all my queries and made me understand the intricacies involved with my kidney issue I strongly recommend him for any Urology related issues.", "label": "positive"}
{"text": "Manjunath kp said he will come at 8 pm on September 16 still he is not here And my kid is having fever there are many patients waiting from 7pm now it's already 9 pm.", "label": "negative"}
{"text": "Courteous treatment by the attending support staff Dr Sarat Damodar is excellent and very helpful in making me to understand the issues involved and put me on satisfactory regimen Thanks to him and everyone at NMH.", "label": "positive"}
{"text": "Money loot Hospital Emergency ward is not actually it is It is a fun ward on patients They cannot able to identify the Root cause of the problem.", "label": "negative"}
{"text": "They charged us 1 lakh rs for just 24 hrs hospitalization On arguing and checking the bill after I almost paid the money.", "label": "negative"}
{"text": "Very good consultation with dr Karthik sir General medicine I Ã m really happy and coordinatior Revathi also helped me a lot I am really tanks to dr Karthik and Revathi I am really recommend to this dr and hospital.", "label": "positive"}
{"text": "Everyone in staff as well as doctors were very helpful and with good behaviour Had a smooth experience through my consultation and diagnoses for a week.", "label": "positive"}
{"text": "Excellent treatment Best doctors and nurses My kid got well in 3 days.", "label": "positive"}
{"text": "Completely unhelpful and exploitative staff None of the Narayana Brand principles are followed here They will exploit you for money with uneccessary tests and procedures Got refused twice in ER as well when family members had emergency.", "label": "negative"}
{"text": "Well organised helpful and supporting staff and above all very professional and experienced doctors who listens and understand the patients.", "label": "positive"}
{"text": "Dr saji orthopedic is an asset of the hospital His way of treatingPatients is excellent We are happy.", "label": "positive"}
{"text": "Best management best doctors and best services I am going to Narayana hrudayalaya since 15 years and always satisfied with the consultations and doctors.", "label": "positive"}
{"text": "Excellent Prompt hospitality services During stay of 1 week Doctors paid continuous visits & responded as needed promptly At one point they had to be vigilant whole night & saved the patient.", "label": "positive"}
{"text": "Extremely knowledgeable and very good Doctors I have been admitted for a infection and lung issues Very courteous and professional supporting staff.", "label": "positive"}
{"text": "We had to wait an hour despite having an appointment This isnâ€™t the first time this happened They have no understanding of how to manage the appointment queue itâ€™s just so random and unorganised and a lot of scope to improve.", "label": "neutral"}
{"text": "NH is one of the best hospital at hsr When we went there at first Mr Dileep Kumar coordinated the visit with our doctor and the visit was also comfortable and quick.", "label": "positive"}
{"text": "Consulting uther dr babu reddy sir past 2yars for cardiologist strong good treating well and we'll explaining each and very thing take caring very much about patients can recommend to this dr babu reddy sir and hospital.", "label": "positive"}
{"text": "Drs r very They listen all the issue of patients carefully.", "label": "positive"}
{"text": "Best doctor available in narayana and also hospitality is very nice they provide a good and hyganic diet for patient Daily takes feedback related to their services.", "label": "positive"}
{"text": "Very good service by the hospital staff and nursing and Doctors l am happy about Narayana Hospital HSR.", "label": "positive"}
{"text": "Excellent service The staff were all so polite and Dr Saji was so amazing Would definitely recommend.", "label": "positive"}
{"text": "Worst behaviour by ultrasound consultant She doesn't even speak properly she disconnects the calls in between Better to avoid We decided to do this from outside and move away from Narayana.", "label": "negative"}
{"text": "Look like Hospital doctors are well trained to ask patients to do unnecessary tests to generate more revenue for hospitals and they will also doctors will get some percentage from lab tests.", "label": "negative"}
{"text": "We came for ultra sound for my wife Hospital staff are very helpful and friendly The lady named Sandhya assisting near ultrasound guided her to have water walk around and managing quote well all the patients", "label": "positive"}
{"text": "Very pathetic experience I won't recommend this hospital to anyone.", "label": "negative"}
{"text": "Blood test guy was also good with his service But their ultra-sound testing service is very poor Won't suggest to do that from hospital.", "label": "neutral"}
{"text": "Got a good experience during surgery of knee replacement for my mother.", "label": "positive"}
{"text": "the quality of the hos has tumbled down drastically Their nursing station do not honour the appointment time and they are clueless when to send a patient again back to the doctor", "label": "negative"}
{"text": "Everything was perfectly organised", "label": "positive"}
{"text": "The staff was highly attentive and professional ensuring my comfort throughout my visit and The facility's cleanliness and organization were also impressive.", "label": "positive"}
{"text": "I had many complications but she identified them at an early stage and continuously monitored the same to ensure a safe delivery During the delivery a smooth normal delivery", "label": "positive"}
{"text": "A very poor experience of service by staffs food and they charge a bomb and Utter nonsense happened while I got admitted for a knee surgery.", "label": "negative"}
{"text": "One of many prominent hospitals found in Bangalore Found good service when visited last time for an emergency visit All the necessary tests were done in quick time", "label": "positive"}
{"text": "I spent a good 5 hrs in that hospital for tests and consultations While the doctors are good the helping staff have no clue Especially the utility staff.", "label": "neutral"}
{"text": "Poor experience for billing and Poor experience for billing.", "label": "neutral"}
{"text": "I went to the hospital for minor symptoms like a cold there were no problems but when I went to the hospital for an emergency there seemed to be a lot of problems.", "label": "negative"}
{"text": "Grateful for the exceptional care and expertise at Manipal Hebbal Dr Shafalika and the staff made our visit stress immense appreciation and heartfelt thanks.", "label": "positive"}
{"text": "Efficient and compassionate emergency care though opted for surgery elsewhere due to cost grateful for the supportive billing team's prompt refund assistance.", "label": "neutral"}
{"text": "I was thoroughly impressed with the level of care and professionalism The doctors and nurses were knowledgeable and took the time to explain my treatment plan in a way that I could understand", "label": "positive"}
{"text": "The services are up-to international standards Just one thing which annoys is they charge you parking fee even if you are spending thousands of money for treatment", "label": "neutral"}
{"text": "The management in reception are not more active I booked appointment through IHO for cunsultation I struglled too much for my appointment Overall behavior of all staff menbers are polite.", "label": "neutral"}
{"text": "Horrible condition of everything Blocked toilets blocked sinks unclean floors patient bed is also shaking and making noises Hospital making lots of money still not using for renovations Pathetic.", "label": "negative"}
{"text": "The comprehensive care provided by Manipal Hospital from the CCU and ICU units to the nursing stations was outstanding.", "label": "positive"}
{"text": "High cost paid parking even on admittance Management with high number of inpatient capacity theyâ€™re extremely busy nursing multiple patients and some misses here.", "label": "neutral"}
{"text": "I recently visited this hospitality in Bangalore l I had a great experience Stars are very friendly and attentive Hospital is very clean and well maintained.", "label": "positive"}
{"text": "Horrible experience after colonoscopy Staff was talking rudely to her and when she told that she was in pain she was told not to make noise.", "label": "negative"}
{"text": "Came for annual health checkup faced lot of issue to start the process Even booked 2 days before No staff poor management for a health checkup 6 hours.", "label": "negative"}
{"text": "We couldnâ€™t get an appointment with Dr Abhijit but needed to see him urgently for my mother She was so kind and proactive and spoke to the doctor immediately and he kindly agreed to see her.", "label": "positive"}
{"text": "She helped with booking an appointment with lab tests as well as helping me with a consulting doctor and made sure I go through a smooth process when I'm on my low Hos service was good as well.", "label": "positive"}
{"text": "The worst experience that I ever had at the hospital when I took my son to the emergency ward recently There was no bed in the emergency room for my son.", "label": "negative"}
{"text": "Worst facility no proper treatment provided to the patient and before estimated the bill will be limited to the extend and post that itâ€™s gonna be double and triple for unwanted test been performed.", "label": "negative"}
{"text": "No response from management properly and everything delay things never go smooth we need to wait for hours n hours even if the patient is under emergency they never take incharge of belonging", "label": "negative"}
{"text": "Dear team hospital service and responsibilities of each staff was really good and pleasing she saved my energy and time as well Thanks.", "label": "positive"}
{"text": "its simply four walls with marble floors and some people roaming around in green blue scrubs and some rooms that claim to be seating doctors Definitely not a hospital.", "label": "negative"}
{"text": "adiology department is very clean and give good service I am happy.", "label": "positive"}
{"text": "We do not have enough word to express our gratitude towards Dr Vijaya for her attention expertise behaviour and understanding towards patient.", "label": "positive"}
{"text": "There has been a big issue is billing we were charged twice for room charges and insurance company also gave approval without a check for thier part of payment.", "label": "negative"}
{"text": "The overall billing experiance made my impression as the management is just keen and making money be it even unethical.", "label": "neutral"}
{"text": "Hospital staff only provided an estimation post discharge estimation has changed and taken 60k extra.", "label": "negative"}
{"text": "after take over by Manipal Management is not bothering about patients they need only Money.", "label": "negative"}
{"text": "These walls have seen better days This establishment is looking like it's losing its zeal that was once loved and admired.", "label": "neutral"}
{"text": "The staff seem to have become less responsive and lax after covid or probably under the new management.", "label": "negative"}
{"text": "I had an good experience in this Hospital where in the doctors are very helpful and experienced.", "label": "positive"}
{"text": "Not so impressed with checkup but somehow have accepted Overall feels Not worthy.", "label": "neutral"}
{"text": "My experience was really good here Supportive staffs and nurses Thank you Manipal and Team.", "label": "positive"}
{"text": "Worst experience Nurse station has no clue when doctor gonna see patient You will never find any doctor in their allotted room.", "label": "negative"}
{"text": "Reception is eager to get the review even before service is delivered I got an appointment at 10:20 but it is changed to 11 AM I am not communicated on the same.", "label": "negative"}
{"text": "May be the treatment is good depends on the doctor but worst nursing experience management is average and the cost of treatment especially is abruptly and absurdly high.", "label": "neutral"}
{"text": "Their cafeteria is an ABSOLUTE MESS Staff is clueless Apparently for health check up packages the menu is separate.", "label": "negative"}
{"text": "We are convinced Henceforth we will continue our treatment here Keep up the Good work Manipal Hebbal.", "label": "positive"}
{"text": "This is unexpected waste time is more here please go to near by hospital Government hospital is better than this bloody hospital.", "label": "negative"}
{"text": "We were at manipal to get my father treated for CBAG and we had a wonderful experience.", "label": "positive"}
{"text": "It was amazing consultation and so friendly with us In the starting reception miss Sowmya she is so friendly and very kind with us and she will do warm greetings with us.", "label": "positive"}
{"text": "My sister got an admitted here for delivery treatment was given well n also care well by staff.", "label": "positive"}
{"text": "hey get the patient admitted in the ICU for a silly reason and charge â‚¹60000 per day also they don't diagnose the patient properly and they don't care about the patients", "label": "negative"}
{"text": "There is parking charge for both 2 & 4 wheelers And there is no point in booking an appointment as they won't stick to the timings for OP Managing needs to be streamlined", "label": "negative"}
{"text": "We have been waiting more 2hr their is no doctor at least no response from management that doctor will late", "label": "negative"}
{"text": "They add the charges for medicines which are not even prescribed.", "label": "negative"}
{"text": "I had the worst experience prices are high and service is too bad that reception staff makes you wait for hours.", "label": "negative"}
{"text": "I had the best treatment during my stay in hospital Now I am back to normal works.", "label": "positive"}
{"text": "we are very grateful for the medical support and hospitality provided I highly recommend this hospital for its highly professional medical services.", "label": "positive"}
{"text": "He helped me with everything and made my job easy Overall I had a great experience at manipal hospital hebbal.", "label": "positive"}
{"text": "That was a great experience to have selected Manipal hospital Hebbal out of other competitors around.", "label": "positive"}
{"text": "The treatment she received here was excellent She had multiple injuries but with the help of the doctors and staff here she is completely re overed now.", "label": "positive"}
{"text": "I had worst experience in this hospital Simply they are charging more finally patient wil not get any solution.", "label": "negative"}
{"text": "he took us through very smooth process for my mom's surgery and everything went well by God's grace.", "label": "positive"}
{"text": "Excellent health care hospital and intelligent and humble doctors but fees structure is more.", "label": "neutral"}
{"text": "Very friendly staff Made our health package procedure smooth and hastle free.", "label": "positive"}
{"text": "I didnt have hard copies of the report but she was so helpful tat she immediately gave me the hardcopy of the report for me.", "label": "positive"}
{"text": "I had been struggling to find some vaccine that was needed for a foreign college admission the entire staff were helpful.", "label": "positive"}
{"text": "Overall we got good treatment from the hospital faculty and the doctors.", "label": "positive"}
{"text": "Dr Shridhar Singh(Ortho) he is such a scammer and remaining staff is good I must say he should be removed from hospital.", "label": "neutral"}
{"text": "Radiology department is good and radiology staffs are very helpfull specilly in radiology nurse swapna.", "label": "positive"}
{"text": "manipal as a whole its good But this branch is literally useless no doctors.", "label": "neutral"}
{"text": "Great experience Mr Vishaal from International department was very helpful with the Dr appointments and all the tests Hassle free experience.", "label": "positive"}
{"text": "very professional and friendly towards patients Staffs were also very kind and cooperative.", "label": "positive"}
{"text": "Staff is so polite and friendly Doctors are kind and diagnosed throughly Had a great experience", "label": "positive"}
{"text": "He spends quality time with me and explains my kidney issues and lays out a plan to handle these issues We are very happy with the hosp.", "label": "positive"}
{"text": "Overall we have received very good service from Manipal Hospital Hebbal team.", "label": "positive"}
{"text": "This is one worst hospital and money making.", "label": "negative"}
{"text": "Manipal taking over Columbia Asia has made everything nonsense To take appointments I had to call 10 times", "label": "negative"}
{"text": "I had a worst experience today doctor suggested sdp process to transfer platlets O+ blood is not available in labs in manipal hospital.", "label": "negative"}
{"text": "Excellent health care hospital and intelligent and humble doctors", "label": "positive"}
{"text": "they are just playing with the patients to earn money they donâ€™t give medicine which is prescribed by doctors and give local medicine", "label": "negative"}
{"text": "one of the worst hospital no maintenance no communication and no humanity too Dr sunil cardio he is worst doc possible", "label": "negative"}
{"text": "if any anyone is in critical emergency go to some other hospitals not for this govt hospitals are far better than this for them patients are ATM cards not just patients i request.", "label": "negative"}
{"text": "Their expertise explanations and exceptional care made this a top-notch experience Highly recommend them for anyone seeking excellent dental care.", "label": "positive"}
{"text": "I was admitted to manipal hospital for my surgery Nurses & doctors did their jobs really well Food was awesome & tasty", "label": "positive"}
{"text": "It's expensive since I had insurance it was manageable but more more charges in parking.", "label": "neutral"}
{"text": "Don't go for opd they try to admit to emergency or make you wait like hell.", "label": "neutral"}
{"text": "Excellent hospitality Everyone made us feel comfortable and guided thru Eco and ECG tests.", "label": "positive"}
{"text": "This hospital is nice All the sections are well organised and the staffs are also very polite really like this ambience and facilities.", "label": "positive"}
{"text": "You may go for it without any second thought.", "label": "positive"}
{"text": "it was hectic dealing with people at MANIPAL HEBBAL the doctors are amazing undoubtedly", "label": "neutral"}
{"text": "it was hectic dealing with people at MANIPAL HEBBAL the doctors are amazing undoubtedly but before we reach the doctors we deal with these buffoons and this is troublesome.", "label": "neutral"}
{"text": "The services are up-to international standards something which hampers the brand value of Manipal Other than that everything seems to be valuable.", "label": "neutral"}
{"text": "they will ask you to register first by paying 1000 and then tell that they donâ€™t have the medicine please try the other hospital.", "label": "negative"}
{"text": "Helped us detect an important issue via blood test performed during our stay in emergency I initially thought why the blood test was expensive", "label": "positive"}
{"text": "I can't thank you enough for the special excellent care you have provided and for the unique gift you are to your patients", "label": "positive"}
{"text": "Thank you so much for the great care and surgery you performed on me.", "label": "positive"}
{"text": "We are extremely very happy with his treatment From admission to discharge everything went smoothly.", "label": "positive"}
{"text": "Very good and fast service.", "label": "positive"}
{"text": "This hospital is nice All the sections are well organised and the staffs are also very polite.", "label": "positive"}
{"text": "Doctors are good but the mangement and services provided are atmost negligent and pathetic.", "label": "neutral"}
{"text": "the treatment is good but bit costly.", "label": "neutral"}
{"text": "Doctor is very professional Good good service from all other staff.", "label": "positive"}
{"text": "The ICU is clean spacious silent and had several patients Only one visitor was allowed at a time.", "label": "positive"}
{"text": "My father is underwent Hip Replacement Surgery with Dr Navinchand We are really very happy with his surgery My father recovering very quickly.", "label": "positive"}
{"text": "I had an exceptional experience at Manipal Hospital Found good service when visited last time for an emergency visit.", "label": "positive"}
{"text": "Except the doctors everything was a mess.", "label": "negative"}
{"text": "Facility staff and cleanliness is missing.", "label": "negative"}
{"text": "Spl Mention for nursing staff who are patient and provided great support", "label": "positive"}
{"text": "Hygiene conditions are poor I saw rats running around the emergency room.", "label": "negative"}
{"text": "The care by the emergency team was prompt and quick The cost of surgery was expensive", "label": "neutral"}
{"text": "I was thoroughly impressed with the level of care and professionalism I encountered.", "label": "positive"}
{"text": "Good hospital in the Hebbal Bengaluru area.", "label": "positive"}
{"text": "Had only Anzio happened for 4 days of hospitalization before I rise my voice.", "label": "negative"}
{"text": "Patient care staffs is excellent and dedicated excellent service of doctors were excellent in all ways thanks everything was good.", "label": "positive"}
{"text": "First time got admitted here Horrible condition of everything Blocked toilets blocked sinks unclean floors patient bed is also shaking and making noises", "label": "negative"}
{"text": "I recently visited this hospitality in Bangalore I had a great experience Stars are very friendly and attentive Hospital is very clean and well maintained.", "label": "positive"}
{"text": "Dr Chandan and Dr Rehan Syed at Manipal Hospital deserve accolades for their exceptional expertise in angiogram angioplasty and heart surgery", "label": "positive"}
{"text": "The hospital staff is pretty welcoming The services are up-to international standards Just one thing which annoys is they charge you parking fee", "label": "neutral"}
{"text": "Aisha the customer case supervisor was fantastic", "label": "positive"}
{"text": "The worst experience that I ever had at the hospital when I took my son to the emergency ward recently.", "label": "negative"}
{"text": "Worst facility no proper treatment provided to the patient and before estimated the bill will be limited to the extend and post that itâ€™s gonna be double and triple for unwanted test been performed", "label": "negative"}
{"text": "Dear team hospital service and responsibilities of each staff was really good and pleasing.", "label": "positive"}
{"text": "Its simply four walls with marble floors and some people roaming around in green blue scrubs and some rooms that claim to be seating doctors.", "label": "neutral"}
{"text": "Radiology department is very clean and give good service", "label": "positive"}
{"text": "The facilities in the hospital are really good All the working staff and nurses does their jobs properly.", "label": "positive"}
{"text": "1st star for well maintained hospital 2nd star for Finally got a treatment.", "label": "positive"}
{"text": "Dr Suma mam treat was very friendly explain very detailed and taken care like a family member", "label": "positive"}
{"text": "I had admitted my grandmother in Manipal Hospital My experience was really good here.", "label": "positive"}
{"text": "Reception is eager to get the review even before service is delivered.", "label": "negative"}
{"text": "Doctors and Staffs are Professionals In front desk the way they welcome us with Folded hand namaste with Smile is amazing.", "label": "positive"}
{"text": "May be the treatment is good depends on the doctor but worst nursing experience management is average and the cost of treatment especially is abruptly and absurdly high", "label": "neutral"}
{"text": "We were at manipal to get my father treated for CBAG and we had a wonderful experience here the doctor we first consulted", "label": "positive"}
{"text": "Worst Experience This hospital doesn't deserve even one star it's too expensive and no proper treatment.", "label": "negative"}
{"text": "There is parking charge for both 2 & 4 wheelers And there is no point in booking an appointment as they won't stick to the timings for OP Managing needs to be streamlined.", "label": "neutral"}
{"text": "Went to get my checkup Wasnâ€™t familiar with this hospital as this was my first visit Staff was very Friendly and helpful", "label": "positive"}
{"text": "The management is worst.", "label": "positive"}
{"text": "Really bad experience I'm truly baffled by all the 5 star reviews on the page I wonder if the doctor paid for them The service is really overpriced.", "label": "negative"}
{"text": "I underwent bypass heart surgery ( MICABG ) at Manipal hospital Hebbal Bangalore on 05-09-2023 I had the best treatment during my stay in hospital.", "label": "negative"}
{"text": "Mr Vishal and Dr Aradhana Sood were very welcoming and always ready to assist.", "label": "positive"}
{"text": "Meet Dr Aradhana Sood The Dr is highly qualified and expert I am extremely happy with the consultation and the staff.", "label": "positive"}
{"text": "I had the worst experience prices are high and service is too bad that reception staff makes you wait for hours nurses also don't know when will doctor come they don't have any list of patients.", "label": "negative"}
{"text": "My daughter was admitted here when she had met with an accident The treatment she received here was excellent.", "label": "positive"}
{"text": "Horrible experience after colonoscopy I sent my parents who live alone in bangalore for coloniscopy.", "label": "negative"}
{"text": "Manipal is the Best Hospital in Bangalore.", "label": "positive"}
{"text": "My uncle operated Knee replacement surgery in Manipal hospital Hebbal Excellent health care hospital and intelligent and humble doctors like Dr Kiran Chouka.", "label": "positive"}
{"text": "Very friendly staff Made our health package procedure smooth and hastle free", "label": "positive"}
{"text": "This hospital is nice All the sections are well organised and the staffs are also very polite Really like this ambience and facilities.", "label": "positive"}
{"text": "Wonderful experience at the hospital I had been struggling to find some vaccine that was needed for a foreign college admission.", "label": "positive"}
{"text": "My dad got treatment for bacterial meningitis in Manipal Hebbala Doctors Mr Anil and Mr Srinivasa Raju took care of him.", "label": "positive"}
{"text": "I wish there would have been an option to give 0 star for Dr Shridhar Singh(Ortho) he is such a scammer and I must say he should be removed from hospital.", "label": "negative"}
{"text": "Do not and I mean it Do not get ur test done here I got my MRI report in 4days My wife CT scan and blood report also they messed up", "label": "negative"}
{"text": "Our first visit to the hospital Great experience Mr Vishaal from International department was very helpful with the Dr appointments and all the tests Hassle free experience.", "label": "positive"}
{"text": "Update as of 15th Oct Ms Sharmila from MH dropped a note to me with details and I have responded with artefacts Hope I will get justice.", "label": "negative"}
{"text": "Manipal taking over Columbia Asia has made everything nonsense To take appointments I had to call 10 times.", "label": "negative"}
{"text": "I will not recommend this hospital to anyone I had a worst experience today I have admitted my wife in hebbal manipal doctor suggested sdp process to transfer platlets", "label": "negative"}
{"text": "I have severe abdominal pain n the customer care said he will arrange a video call with doctor to understand and suggest me medication but then no body turned n again", "label": "negative"}
{"text": "one of the worst hospital no maintenance no communication and no humanity too Dr sunil cardio he is worst doc possible.", "label": "negative"}
{"text": "Had an amazing dental procedure experience with Dr Sindhu and Dr Bhargav for my wife Manisha From start to finish they were professional caring and made me feel at ease.", "label": "positive"}
{"text": "We have been consulting Dr Sunil Kumar Cardiology Dr Girish Nephrology Dr Udnur Pulmonology and Dr Abhijit Bhograj Diabetology since 2021 I must say they are a great team of doctors.", "label": "positive"}
{"text": "I was admitted to manipal hospital for my surgery Nurses & doctors did their jobs really well.", "label": "positive"}
{"text": "The staff is incompetent Dealing with them was tedious.", "label": "negative"}
{"text": "Don't go for opd they try to admit to emergency or make you wait like hell I went in the morning with mild fever.", "label": "negative"}
{"text": "Had consulted Cardiologist Dr Chandan Excellent hospitality by Dr Chandan and front desk Everyone made us feel comfortable and guided thru Eco and ECG tests.", "label": "positive"}
{"text": "The hospital staff is pretty welcoming.", "label": "positive"}
{"text": "I've admitted in labour ward for delivery the treatment is good but bit costly.", "label": "neutral"}
{"text": "This place is a nightmare they will ask you to register first by paying 1000 and then tell that they donâ€™t have the medicine please try the other hospital.", "label": "negative"}
{"text": "Helped us detect an important issue via blood test performed during our stay in emergency.", "label": "positive"}
{"text": "My aunt TKR Surgery done with Dr Ravichandra Kelkar We are extremely very happy with his treatment", "label": "positive"}
{"text": "Very good and fast service Mr Vishal helped a lot and thanks to him we were able to receive the services and care within 20 minutes", "label": "positive"}
{"text": "Doctors are good but the mangement and services provided are atmost negligent and pathetic", "label": "neutral"}
{"text": "Dr Bhargav and Dr Sindhu (Dental) are SUPER STARS Had been there last Saturday and today for my daughter's check up and consultation and they very patiently checked provided expert advice", "label": "positive"}
{"text": "I went to Manipal hebbal for a check up The front desk person Somya was really courteous He helped me get paid with additional information", "label": "positive"}
{"text": "My grandmother was admitted in cardiology department excellent doctors who explain condition prognosis and treatment plan in simple manner.", "label": "positive"}
{"text": "it's is good experience Doctor are very nice they treat the patient very nice staff r very good.", "label": "positive"}
{"text": "On Sunday staff are minimal non of the staff will help you at any cost if patient die even though they doesn't care for a single report they need 2 days of time.", "label": "negative"}
{"text": "Doctors are knowledgeable in the hospital but Please beware of Mr Chinna Kesava head of billing and payment department He will charge you for some thing that is not in the prescription.", "label": "negative"}
{"text": "The doctors are good but it is a very mismanaged hospital.", "label": "neutral"}
{"text": "The supervisor( Vivek) is not at working place not supervising anything really the management should look into it", "label": "negative"}
{"text": "We have been coming to Manipal for our parents from last 2 years and have been getting a very cordial support from the staff and the team.", "label": "positive"}
{"text": "It was amazing consultation at manipal hospital they were very kind and friendly I heartfully prefer everyone must visit manipal hospital thanks to dr indranil.", "label": "positive"}
{"text": "Good and helpful staff doctor described issues clearly instead giving medicines directly", "label": "positive"}
{"text": "Very good hospital in the area Management is little messy at times but not always.", "label": "positive"}
{"text": "Don't go for health checkup packages here very bad management no one assists.", "label": "negative"}
{"text": "I wish to give a rating which will shut down this hospital and cancel license for orthopedic surgeon Dr NavinChand Dambekodi They ended up killing my Dad.", "label": "negative"}
{"text": "Worried about the humanity how this hospital treat emergency case", "label": "negative"}
{"text": "Loved the services from all the staff staff members were very helpfuldr Santosh is very professional very much satisfied with the overall experience.", "label": "positive"}
{"text": "Very good experience overall right from appointment booking to rescheduling promptness of the staff.", "label": "positive"}
{"text": "This place is very unreasonablly expensive.", "label": "negative"}
{"text": "I had been there for comprehensive health check up and was impressed to find very streamlined approach", "label": "positive"}
{"text": "Attention to patient is bit lagging zero guidance & connectivity between departments for single patient.", "label": "negative"}
{"text": "Coming here for the past 17 years the doctors are really good and the overall service is superb", "label": "positive"}
{"text": "NU hospital provide excellent service for the patient They follow up everyday 3 to 4 times to the patient", "label": "positive"}
{"text": "Like the hospital Affordable plan is easy to operate and saving me some money with the cash back discount", "label": "positive"}
{"text": "The canteen provided excellent food and service", "label": "positive"}
{"text": "they charge us to park our vehicle in their own hospital and make us wait for hours.", "label": "negative"}
{"text": "We're coming here for quite a long time The staffs here are very friendly and helpful", "label": "positive"}
{"text": "Room attendants are so kind and always make sure the room is cleaned and always replenish the amenities", "label": "positive"}
{"text": "Doctors are so kind and always give updates regarding the patient and fees structure is more", "label": "neutral"}
{"text": "they did my transplant done successfully Hospital for giving second life for me", "label": "positive"}
{"text": "Good service Front office staff is treated good and doctors also i will refer my family to this hospital.", "label": "positive"}
{"text": "To earn money they will copy and paste the reports and if the patient ask for an explanation not even one doctor will be available.", "label": "negative"}
{"text": "Exlent service about food and tast very good but staff is not nice", "label": "neutral"}
{"text": "Insurance department for helping with the process Overall Experience was really good.", "label": "positive"}
{"text": "Some patients expressed dissatisfaction with waiting times for appointments.", "label": "negative"}
{"text": "A few reviews mentioned issues with administrative processes.", "label": "negative"}
{"text": "Specialized care and expertise in nephrology and urology.", "label": "positive"}
{"text": "Professional and knowledgeable medical staff But Nurse are not knowledgeable", "label": "neutral"}
{"text": "Clean and well maintained facilities But doctors are too late", "label": "neutral"}
{"text": "I had a good experience during the time I spend in the hospital", "label": "positive"}
{"text": "service is very good and nurse and front office staff are taking personal care plz visite", "label": "positive"}
{"text": "Awesome hospital and its management is good all the staff are good and disciplined for their work", "label": "positive"}
{"text": "they provide help and guidance every step of the way to get the best care possible.", "label": "positive"}
{"text": "The Staff and doctors were not good and very poor professional", "label": "negative"}
{"text": "It's was good hospital and they all help us very well in parking system more fees structure", "label": "neutral"}
{"text": "the staffs of this hospital are realy helpful and the hospitality is excelent", "label": "positive"}
{"text": "Good service in all staffs and well maintained", "label": "positive"}
{"text": "I received excellent service in this hospital", "label": "positive"}
{"text": "No proper management nothing is organised you will wait for hours with no proper response from staff they will put your patience to test", "label": "negative"}
{"text": "there was a more delays on anything I am happy to get medication from this hospital", "label": "negative"}
{"text": "Every single person we met at your hospital were so kind caring and friendly the tremendous support recieved from the hospital from the first day", "label": "positive"}
{"text": "good hearted person well qualified doctor and she has good sense of humour best hospital.", "label": "positive"}
{"text": "Good experience overall Doctors are well experienced in Nephro and Urology Hospital staff is very helpful and cooperative.", "label": "positive"}
{"text": "Once we arrived to the hospital she was always there to guide us through the procedures and even directions.", "label": "positive"}
{"text": "No proper management they will put your patience to test", "label": "negative"}
{"text": "they didn't explain complications and about the procedure before procedure was done But consent form it's written explained.", "label": "neutral"}
{"text": "I have only one complaint regarding consent taking for procedures didn't explain complications", "label": "negative"}
{"text": "No helping nature no support All lab staff are worst no use of working as lab technician in that lab No support to each other.", "label": "negative"}
{"text": "The place is very well maintained with cleaning happening throughout the day.", "label": "positive"}
{"text": "Being a international travel with full insurance coverage this hospital was the best treatment we had so far", "label": "positive"}
{"text": "who has contacted the very beginning when we got approved from Government and asked about the travelling time also if we needed any help from Airport to hotel", "label": "positive"}
{"text": "i strongly recommend not to go that hospital very worst hospitality.", "label": "negative"}
{"text": "Bad experience at the first i went for kidney stones remove consultation doctor did not give proper answer to the issue its just money eating hospital", "label": "neutral"}
{"text": "Worst staff please don't go that lab my personal advice to all the lab technician", "label": "negative"}
{"text": "Best treatment for uro nephro issues our experience was pretty good admitted for kidney stone problem nursing doctors Well experienced.", "label": "positive"}
{"text": "Doctor is very good and he is having patience to explain very well but more cost.", "label": "neutral"}
{"text": "After that doctor will see But when check waiting number was increasing", "label": "neutral"}
{"text": "if the patient is ready with report and other patients coming after them are getting consultation old patients have to wait.", "label": "negative"}
{"text": "I came in with bad kidney pain and got help immediately Had a brief stay in the ER that was quite good.", "label": "negative"}
{"text": "Excellent treatment from hospital Accommodation and food are good.", "label": "positive"}
{"text": "Teartment wise really happy specially dialysis department Team work is good I will suggest to my know friends and family members to choose nu hospital", "label": "positive"}
{"text": "he was so rude/mechanical towards patient pls train this doctor how to be empathetic towards patient first.", "label": "negative"}
{"text": "Everybody is so well trained & loving right from cleaners helpers I would highly recommend this hospital.", "label": "positive"}
{"text": "Very confer table but bit costly best treatment for kidny", "label": "neutral"}
{"text": "Very much helpful and friendly to patients I suggest dialysis patients to reach nu hospital", "label": "positive"}
{"text": "took care of end to end process with out any burden to the patient attendees", "label": "positive"}
{"text": "the too good service and treatment I feel to refer patients who needed Urology Nephrology treatment at NU hospital.", "label": "positive"}
{"text": "Providing good health services And giving a well guidline regarding health care.", "label": "positive"}
{"text": "Doctor consultation is excellent but the service from the the staff is not satisfied", "label": "neutral"}
{"text": "removed my all old reports from file and shuffled all the reports and once after uploading the report given the old report in teared manner which is very worst thing", "label": "negative"}
{"text": "One of the best hospital to get treatment Hospital staff and doctors are very friendly and kind Hospital is very clean and tidy", "label": "positive"}
{"text": "This hospital everyone is so good Very helpful also.", "label": "positive"}
{"text": "They ensured I had a smooth prep surgery and follow-up I am so glad I chose (Nu hospital)", "label": "positive"}
{"text": "waiting long time even before consultation and after consultation", "label": "negative"}
{"text": "I am not no about inpatient service but excellent service by outpatient department thankyou once again.", "label": "neutral"}
{"text": "This is our pleasure to inform you that it's a great hospital and staff of customer care more professional and they are giving nice Hospitality.", "label": "positive"}
{"text": "Doctors and co ordinators are very good supportive people and excellent service from staff", "label": "positive"}
{"text": "Excellent service and good doctor Special thanks to Dr Aashish and Ranjitha madam she guided us excellent.", "label": "positive"}
{"text": "Doctors are good but the toilets are very stinky smell everywhere in the reception also canâ€™t sit neatness should maintain near restroom", "label": "neutral"}
{"text": "Good hospital and staffs are nice good service and I will suggest cleanness.", "label": "neutral"}
{"text": "He has explained the diagnosis in detail and the treatment procedures very clearly Pharmacy staffs were also very kind and fast in providing their service", "label": "positive"}
{"text": "One of the best hospitals I have visited in India Friendly and welcoming care from nurses and insurance staffs.", "label": "positive"}
{"text": "the toilets are very stinky smell everywhere in the reception also canâ€™t sit neatness should maintain near restroom", "label": "negative"}
{"text": "Pharmacy staffs needs to be more professional in checking the doctorâ€™s prescription and writing the dose on the medicine.", "label": "neutral"}
{"text": "more cost in parking system so worst experience but Good Service from the staff team and doctors", "label": "negative"}
{"text": "It's good Hospital we come as a walk in to See urologist but they guide very well and nice atmospher and supportive staff.", "label": "positive"}
{"text": "The hospital is very hygienic Overall the experience was very hassle free as everything was very well managed and organized.", "label": "positive"}
{"text": "Enjoyed the local food served at the hospital cafeteria The management ensured that we were comfortable", "label": "positive"}
{"text": "I m satisfied with the service But it seams bit costly compared with othere hospitals.", "label": "neutral"}
{"text": "it's more costly compared to the other hospital worst toilets cleaning", "label": "negative"}
{"text": "Good hospital for all kind of neurology and urology well hygiene and organised hospital all kind of testing laboratory related to kindney is available", "label": "positive"}
{"text": "We had a great experience and appreciate it Will recommend to family and friends.", "label": "positive"}
{"text": "they have told me that you need to wait for sometime because first you need to tell all the history of the patient to other doctor then you can meet the main doctor", "label": "negative"}
{"text": "she have misplaced our reports and we didnâ€™t get that reports only after that.", "label": "negative"}
{"text": "She is such a ill mannered doctor without any ethics Please guys donâ€™t consult her for future visits.", "label": "neutral"}
{"text": "The hospital building itself was well maintained and hygienic with facilities staff keeping to the highest standards.", "label": "positive"}
{"text": "Hi NU is very Good hospital All the staffs and doctors are friendly They have very Good team.", "label": "positive"}
{"text": "Only go to this hospital if you are not in need of immediate care and have the time to wait for hours [at least 3 hours] just to meet the doctor.", "label": "negative"}
{"text": "They are so efficient and excellent in making their patients wait You do need a lot of patience to be a patient here.", "label": "negative"}
{"text": "You'd reach this hospital faster from Silk Board despite the traffic than meeting the doctor.", "label": "neutral"}
{"text": "Experienced doctors and Management staff Clean and systematic hospital.", "label": "positive"}
{"text": "The staff at NU hospital has been very helpful and kind The services provided for the patient was excellent.", "label": "positive"}
{"text": "Excellent Drâ€™s are here in NU Hospital They treated very well I am very happy with the treatment", "label": "positive"}
{"text": "I never thought we will be taken care at such a level She exceeded our expectations and made our medical trip smooth", "label": "positive"}
{"text": "I wish NU HOSPITAL should do more progress in future to cater the needs of the new urological and renal dieases", "label": "neutral"}
{"text": "They ensured I had a smooth prep surgery and follow-up made our journey easy.", "label": "positive"}
{"text": "NU Hospital is one of the clean hispitals I have ever visited though it does not have a numbering system for the Queue.", "label": "positive"}
{"text": "NU Hospitals believes in patient centricity and is committed to providing the best outcomes and care to its patients.", "label": "positive"}
{"text": "The doctors were very professional and available anytime The nursing staff were very attentive and kind", "label": "positive"}
{"text": "Most of all the International coordinators were very helpful and always with a smile and ready to assist you", "label": "positive"}
{"text": "when a person enter to a hospital that is a very stressful time and if there is some communication issues then it will be really tuff at the customer end.", "label": "positive"}
{"text": "At the start I believe to show the relevant doctors and to do the test it took a long time.", "label": "negative"}
{"text": "NU hospital weâ€™re eternally grateful for your hospitality and knowledge", "label": "positive"}
{"text": "As per the communication some of the staff was very good but some was a little rude", "label": "neutral"}
{"text": "I believe this was a miscommunication from the hospital side And it was noticed by the person in the scan room.", "label": "negative"}
{"text": "However during discharge process I felt it there was a delay both hospital and Aasanda side.", "label": "negative"}
{"text": "I believe in future from hospital side you can make arrangements by taking into consideration to improve communication with customer.", "label": "neutral"}
{"text": "looking at customer view point like waiting for several hrs at hospital for nothing", "label": "negative"}
{"text": "Good service and excellent treatments from doctor's and staff", "label": "positive"}
{"text": "The doctors the nurses and every single staff at NU Hospitals were committed to what they are doing As a patient I felt home being at NU Hospital", "label": "positive"}
{"text": "Itâ€™s so hard to just sit and wait at Operation theater the operation was conducted successfully.", "label": "neutral"}
{"text": "All staffs are good Thank you for Dr Krishna prasad and Dr Imran Khan for giving time and details explanations of my condition", "label": "positive"}
{"text": "He was very patient and was of great help for us throughout the admin process", "label": "positive"}
{"text": "The nurses were super friendly and they will never leave your side if you need attention at anytime while you are admitted.", "label": "positive"}
{"text": "I believe the service I mentioned about doing the test have been improved as I have met someone who did all test with in one to two weeks.", "label": "neutral"}
{"text": "We had very good experience at NU Hospitals West good service and excellent treatments from doctor's and staff", "label": "positive"}
{"text": "I'm really satisfied that I chose NU Hospital for my medical treatment You will be too", "label": "positive"}
{"text": "We cannot praise the NU hospital Cafeteria enough for the amazing food quality and great food.", "label": "neutral"}
{"text": "they are not giving value patients time and money so bad experiences", "label": "negative"}
{"text": "We deeply appreciate the fact that our community has access to such a high-quality organization of professionals and workers.", "label": "positive"}
{"text": "ICU team is best here but pls value patients time and money if you take advance appointment for doctor consultation.", "label": "neutral"}
{"text": "Hospitality provided by the staff Nurses housekeeping team canteen employees was Outstanding Especially the Doctors team", "label": "positive"}
{"text": "best quality of service compared to surrounding hospitals", "label": "positive"}
{"text": "Staff is well behaved and cooperative within their limits Excellent as compared to others", "label": "positive"}
{"text": "The reception team is quite helpful aswell But sometimes I observed that things went haywire due to loopholes in the management.", "label": "neutral"}
{"text": "On the other hand the finance team is bad in providing financial estimate They will try to sell package", "label": "negative"}
{"text": "The lady who leads the finance team is very rude and have got some attitude issues.", "label": "negative"}
{"text": "I had a great experience at NU Hospital West as a new patient and so grateful that my surgery was a success.", "label": "positive"}
{"text": "Over all I would say it's an ok types hospital not good to get 3 stars.", "label": "negative"}
{"text": "The hospital is very clean and the nurses were very caring during my stay after surgery.", "label": "positive"}
{"text": "The staff are very helpful and care they give us great hospitality guid us thank you very much my coordinator from hospital", "label": "positive"}
{"text": "Great service received from hospital All staffs are very good front office Doctor and Nursing.", "label": "positive"}
{"text": "I hau under went PCNL urgery in NU Hospital this was good hospital all the staff was very professional.", "label": "positive"}
{"text": "I am not no about inpatient service but excellent service by outpatient department thank you once again.", "label": "neutral"}
{"text": "hospitals customer is a patient and not a person but in NU hospital clearly customer is a person who needs care", "label": "positive"}
{"text": "NU hospitals provides a personal touch and you can see empathy with doctors nurses and other staff which is lacking in other hospitals.", "label": "positive"}
{"text": "Very nice professional staff in all the blocks but in admin or insurance team a bit rude.", "label": "neutral"}
{"text": "NU hospital is best hospital in Bangalore as this being a Super speciality hospital it has all the basic amenities under one roof", "label": "positive"}
{"text": "My heartfelt gratitude to NU Hospital staff who took care my father in law during admission", "label": "positive"}
{"text": "All staffs are not friendly so that we can feel stressed worst experience", "label": "negative"}
{"text": "we are faceing a lot of difficulties and no one is guiding us some staff is rude.", "label": "negative"}
{"text": "The nurses are very well trained and they know how to take care of the patient The place is very well maintained with cleaning happening throughout the day.", "label": "positive"}
{"text": "NU west hospital lab staff one of worst staff ever I have seen in my life No helping nature no support.", "label": "negative"}
{"text": "Our experience is very very bad with front office staff at urology department We reached at 10:15 AM and left at 5:30 PM with an hour of lunch break.", "label": "negative"}
{"text": "Good response from hospital staff and cleaness and good doctors our experience is very good", "label": "positive"}
{"text": "worst experience We have a mixed experience when visited Two doctors found to be very cordial and patient listeners.", "label": "negative"}
{"text": "if we continue our visit next time Do I get assurances from hospital the patient will be treated properly.", "label": "neutral"}
{"text": "All lab staff are worst no use of working as lab technician in that lab No support to each other.", "label": "negative"}
{"text": "We left the hospital with a hurt feeling We sought an appointment with doctor after MCU test so more delay.", "label": "negative"}
{"text": "Nu hospitals is a good service doctors are Available 24 hours for the any clarification", "label": "positive"}
{"text": "The staff and doctor made us to wait till evening When ever enquired we were told some more patients are in the queue", "label": "negative"}
{"text": "Had an extremely good experience at NU Hospitals Hadn't heard about the place till I had to get admitted there for a procedure.", "label": "positive"}
{"text": "The No of patients before us increased every time when we checked in queue bad experience in queue process I suggest u to do token system", "label": "neutral"}
{"text": "The dietitian is more concerned than the family members and her guidance made a difference as well Iâ€™m glad we chose NU HOSPITAL for our surgery.", "label": "positive"}
{"text": "there were issues at the beginning of the days our last days here were very satisfying.", "label": "neutral"}
{"text": "When we lost patience and sought appointment next day with raised voice This led to unpleasant discussion between doctor and patient", "label": "negative"}
{"text": "Overall good experience with NU Hospital Thanks", "label": "positive"}
{"text": "NU hospital staff are extremely friendly and kind they provide help and guidance every step of the way to get the best care possible.", "label": "positive"}
{"text": "Doctors explain conditions really well and addresses our concerns with outmost generosity Looking forward for best care for our next trip as well.", "label": "neutral"}
{"text": "Providing good health services. And giving a well guidline regarding health care.", "label": "positive"}
{"text": "the experience was very hassle free as everything was very well managed and organized.", "label": "positive"}
{"text": "The hospital and all the staffs are good in service and care I m satisfied with the service But it seams bit costly compared with othere hospitals.", "label": "neutral"}
{"text": "Doctors made sure that we understood how they were going to proceed with the treatment explained it very well The hospital is very hygienic.", "label": "positive"}
{"text": "I want to express my extreme gratitude for the care I received at your hospital.", "label": "positive"}
{"text": "Doctor consultation is excellent but the service from the the staff is not satisfied need to be improved.", "label": "neutral"}
{"text": "Excellent Work done from NU Hospital I love this houspital very much because starff are so helpful and kind", "label": "positive"}
{"text": "Great service doctors team nurse team and all staffs of the hospital are very kind I really appreciate the great work and helps done", "label": "positive"}
{"text": "he always take a lot of time for understanding the patient history /condition", "label": "negative"}
{"text": "Overall Hospital well maintained hygienic clean and having good staff", "label": "positive"}
{"text": "Satisfied with the Service well support from the staffs and happy with the affordplan benefits.", "label": "positive"}
{"text": "the services are in low level However very few times some doctors and nurses shows unhappy faces.", "label": "negative"}
{"text": "Nu hospital is very good n careful n kindness hospital they arrange every thing very comfortable tothe patient", "label": "positive"}
{"text": "one of the hospital staff took my Mobile phone to type the Review HERSELF Fortunately I wasn't signed in.", "label": "negative"}
{"text": "bad experience On the service I don't want to be biased because I'm a middle-class", "label": "negative"}
{"text": "We had a wonderful experience at NU Hospital West Front office Staff were extremely helpful.", "label": "positive"}
{"text": "The services we receive from NU hospital is excellent clarified everything to us in a very clear way Wonderful service from start to finish.", "label": "positive"}
{"text": "Overall we had a great hassle-free experience at NU Hospital but worst staff and more time waste", "label": "negative"}
{"text": "Doctors are experienced and treatment is good however the staff management needs to definetely get better.", "label": "neutral"}
{"text": "Good staffs in help desk helped us throughout the process from visiting doctor to coming out from hospital.", "label": "positive"}
{"text": "Since a year I noticed there is no co-operation from the staff to manage appointments.", "label": "negative"}
{"text": "It is expected that we get to consult the doctor at scheduled time and not whenever the staff gets free. Even the follow up patients are made to wait for hours with no response from staff.", "label": "negative"}
{"text": "I am extremely happy with service and definitely recommend this hospital to my friends and family.", "label": "positive"}
{"text": "everything went smoothly Doctor visits the patient 2-3 times daily Doctors are very informative and responsive to our queries", "label": "positive"}
{"text": "more delay in queue This could easily be fixed if they considered token issuing system for appointments & consultations.", "label": "neutral"}
{"text": "She always takes long time to explain things to me in terms that I can understand.", "label": "neutral"}
{"text": "The only thing we didn't like was the time spent waiting for OPD consultations Had to wait quite a long time.", "label": "negative"}
{"text": "I had a great visit and the doctorâ€™s outward manner has really put me at ease so I highly recommend NU for nephrology problem.", "label": "positive"}
{"text": "An excellent quality health care provider The staffs are helpful environment is very clean and positive", "label": "positive"}
{"text": "very careful about safety measures every one is very friendly love everything about hospital", "label": "positive"}
{"text": "I do not trust in their reports I got same tests done outside and the results were more reliable.", "label": "negative"}
{"text": "They just want the patients to return to their hospital and shell out money They suggest expensive procedures without proper diagnosis", "label": "negative"}
{"text": "I suggest you not to visit this hospital if you care about your health and pocket", "label": "negative"}
{"text": "NU hospital has provided us the excellent service It was amazing comfortable from the moment we entered the hospital with the support they have provided.", "label": "positive"}
